[
    [
        {
            "type": "title",
            "content": {
                "title_content": [
                    {
                        "type": "text",
                        "content": "FRP-Confined Circular Concrete-Filled Thin Steel Tubes under Axial Compression "
                    }
                ],
                "level": 1
            },
            "bbox": [
                194,
                85,
                803,
                138
            ]
        },
        {
            "type": "paragraph",
            "content": {
                "paragraph_content": [
                    {
                        "type": "text",
                        "content": "Y. M. Hu<sup>1</sup>; T. Yu<sup>2</sup>; and J. G. Teng, M.ASCE<sup>3</sup> "
                    }
                ]
            },
            "bbox": [
                313,
                150,
                679,
                170
            ]
        },
        {
            "type": "paragraph",
            "content": {
                "paragraph_content": [
                    {
                        "type": "text",
                        "content": "Abstract: Concrete-filled steel tubes are widely used as columns in many structural systems, and a common failure mode of such tubular columns is inelastic outward local buckling near a column end. The use of fiber reinforced polymer (FRP) jackets/wraps for the suppression of such local buckling has recently been proposed and has been proven by limited test results to possess great potential in both retrofit/ strengthening and new construction. Against this background, this paper presents the results of an experimental study into the behavior of FRP-confined circular concrete-filled steel tubes (CCFTs) under axial compression, as part of a larger study undertaken at the Hong Kong Polytechnic University aimed at the development of a good understanding of the structural behavior of and reliable theoretical models for CCFTs. The experimental program included three series of tests in which the main parameters examined were the thickness of the steel tube and the stiffness of the FRP wrap. The test results showed that the FRP wrap can substantially delay and even completely suppress the development of local buckling deformation in the steel tube. As a result, both the load-carrying capacity and ductility of concrete-filled thin steel tubes can be substantially enhanced with FRP confinement. The behavior of the concrete was also found to be significantly enhanced by the additional confinement from the FRP wrap. DOI: 10.1061/(ASCE)CC.1943-5614.0000217. © 2011 American Society of Civil Engineers. "
                    }
                ]
            },
            "bbox": [
                62,
                202,
                931,
                383
            ]
        },
        {
            "type": "paragraph",
            "content": {
                "paragraph_content": [
                    {
                        "type": "text",
                        "content": "CE Database subject headings: Concrete; Steel; Tubes; Fiber reinforced polymer; Confinement; Buckling; Columns; Compression. "
                    }
                ]
            },
            "bbox": [
                62,
                391,
                929,
                407
            ]
        },
        {
            "type": "paragraph",
            "content": {
                "paragraph_content": [
                    {
                        "type": "text",
                        "content": "Author keywords: Concrete; Steel tube; Fiber reinforced polymer (FRP); Confinement; Buckling; Hybrid column; Tubular column. "
                    }
                ]
            },
            "bbox": [
                63,
                414,
                916,
                429
            ]
        },
        {
            "type": "title",
            "content": {
                "title_content": [
                    {
                        "type": "text",
                        "content": "Introduction "
                    }
                ],
                "level": 1
            },
            "bbox": [
                63,
                455,
                161,
                469
            ]
        },
        {
            "type": "paragraph",
            "content": {
                "paragraph_content": [
                    {
                        "type": "text",
                        "content": "Concrete-filled steel tubes (CFTs) are widely used as columns in many structural systems (Uy 1998; Hajjar 2000). In CFTs, inward buckling deformations of the steel tube are prevented by the concrete core, but degradation in steel confinement, strength, and ductility can result from inelastic outward local buckling. When used as columns subjected to combined axial and lateral loads, the critical regions are the ends of the column in which the moments are the largest. Under seismic loading, plastic hinges form at the column ends, and large plastic rotations without significant degradation in stiffness and strength are demanded here. Against this background, Xiao (2004) proposed a novel form of concrete-filled tubular (CFT) columns, named by him as confined CFT (or CCFT) columns in which the end portions are confined with steel tube segments or FRP wraps. In these columns, as a result of the additional confinement from an FRP or steel segment, both the inward and the outward buckling deformations of the steel tube are constrained, so the ductility and strength of the column can be substantially enhanced in the end regions. In addition, the concrete is better confined with "
                    }
                ]
            },
            "bbox": [
                62,
                483,
                482,
                744
            ]
        },
        {
            "type": "paragraph",
            "content": {
                "paragraph_content": [
                    {
                        "type": "text",
                        "content": "<sup>1</sup>Assistant Resident Engineer, AECOM (Asia) Co. Ltd., Hong Kong, China; formerly Ph.D. Candidate, Dept. of Civil and Structural Engineering, The Hong Kong Polytechnic Univ., Hong Kong, China. "
                    }
                ]
            },
            "bbox": [
                62,
                758,
                482,
                797
            ]
        },
        {
            "type": "paragraph",
            "content": {
                "paragraph_content": [
                    {
                        "type": "equation_inline",
                        "content": "^{2}"
                    },
                    {
                        "type": "text",
                        "content": "Research Fellow, Dept. of Civil and Structural Engineering, The Hong Kong Polytechnic Univ., Hong Kong, China (corresponding author). E-mail: ceyutao@polyu.edu.hk "
                    }
                ]
            },
            "bbox": [
                62,
                797,
                480,
                835
            ]
        },
        {
            "type": "paragraph",
            "content": {
                "paragraph_content": [
                    {
                        "type": "text",
                        "content": "<sup>3</sup>Chair Professor of Structural Engineering, Dept. of Civil and Structural Engineering, The Hong Kong Polytechnic Univ., Hong Kong, China. "
                    }
                ]
            },
            "bbox": [
                63,
                835,
                480,
                861
            ]
        },
        {
            "type": "paragraph",
            "content": {
                "paragraph_content": [
                    {
                        "type": "text",
                        "content": "Note. This manuscript was submitted on November 2, 2010; approved on March 14, 2011; published online on March 16, 2011. Discussion period open until March 1, 2012; separate discussions must be submitted for individual papers. This paper is part of the Journal of Composites for Construction, Vol. 15, No. 5, October 1, 2011. ©ASCE, ISSN 1090-0268/2011/5-850-860/$25.00. "
                    }
                ]
            },
            "bbox": [
                62,
                861,
                480,
                936
            ]
        },
        {
            "type": "paragraph",
            "content": {
                "paragraph_content": [
                    {
                        "type": "text",
                        "content": "the additional confinement from the FRP or steel segment. It is obvious that such FRP confinement of CFTs can be exploited in both structural strengthening and new construction. In the strengthening of CFTs, FRP wrapping provides a simple and effective method to enhance their load-carrying capacity and/or ductility, which is similar to the popular technique of FRP wrapping for strengthening RC columns (Teng et al. 2002; Teng and Lam 2004). In new construction, FRP jacketing of critical regions to enhance strength and ductility of concrete-filled tubes can lead to more ductile and/or more economic structures: the use of local FRP confinement can lead to a substantial reduction in the steel tube thickness, which is dictated by the requirement of the critical regions; the alternative approach of varying the tube thickness along the length is generally too costly to achieve in practice. "
                    }
                ]
            },
            "bbox": [
                511,
                455,
                931,
                654
            ]
        },
        {
            "type": "paragraph",
            "content": {
                "paragraph_content": [
                    {
                        "type": "text",
                        "content": "Following the initial work by Xiao (2004), a number of follow-on studies have been conducted by Xiao and associates (Mao and Xiao 2006; Shan et al. 2007; Xiao et al. 2005), and other researchers (Gu et al. 2004; Tao et al. 2007; Wang et al. 2008; Liu and Lu 2010; Park et al. 2010) on the effectiveness of FRP wrapping in improving the structural behavior of both circular (Gu et al. 2004; Liu and Lu 2010; Shan et al. 2007; Tao et al. 2007; Wang et al. 2008; Xiao et al. 2005) and square/rectangular CFTs (Mao and Xiao 2006; Park et al. 2010; Tao et al. 2007; Wang et al. 2008). Although these studies have clearly demonstrated the benefits of FRP wrapping of CFT columns, much more research is still needed to develop a good understanding of the structural behavior of and appropriate design methods for FRP-confined CFTs. In particular, the aforementioned studies have been concerned only with relatively thick steel tubes, and the circular steel tubes examined had a diameter-to-thickness ratio below 84.7. "
                    }
                ]
            },
            "bbox": [
                511,
                655,
                931,
                878
            ]
        },
        {
            "type": "paragraph",
            "content": {
                "paragraph_content": [
                    {
                        "type": "text",
                        "content": "As part of a larger study undertaken at The Hong Kong Polytechnic University (Hu 2011), several series of axial compression tests have been conducted on CFT columns confined with a glass FRP (GFRP) wrap. The purpose of these axial compression "
                    }
                ]
            },
            "bbox": [
                511,
                880,
                931,
                936
            ]
        },
        {
            "type": "page_header",
            "content": {
                "page_header_content": [
                    {
                        "type": "text",
                        "content": "Check for updates "
                    }
                ]
            },
            "bbox": [
                669,
                17,
                746,
                74
            ]
        },
        {
            "type": "page_aside_text",
            "content": {
                "page_aside_text_content": [
                    {
                        "type": "text",
                        "content": "Downloaded from ascelibrary.org by Beijing University of Tech on 01/22/26. Copyright ASCE. For personal use only; all rights reserved. "
                    }
                ]
            },
            "bbox": [
                0,
                215,
                17,
                779
            ]
        },
        {
            "type": "page_footer",
            "content": {
                "page_footer_content": [
                    {
                        "type": "text",
                        "content": "850 / JOURNAL OF COMPOSITES FOR CONSTRUCTION © ASCE / SEPTEMBER/OCTOBER 2011 "
                    }
                ]
            },
            "bbox": [
                63,
                949,
                665,
                963
            ]
        },
        {
            "type": "page_footer",
            "content": {
                "page_footer_content": [
                    {
                        "type": "text",
                        "content": "J. Compos. Constr., 2011, 15(5): 850-860 "
                    }
                ]
            },
            "bbox": [
                385,
                984,
                611,
                997
            ]
        }
    ],
    [
        {
            "type": "paragraph",
            "content": {
                "paragraph_content": [
                    {
                        "type": "text",
                        "content": "tests is twofold: (1) to examine the benefit of FRP confinement to concrete-filled steel tubes under axial compression; (2) to examine the behavior of confined concrete in CCFTs for future development of a stress-strain model of such concrete that can be deployed in section analysis of design calculations and in seismic performance analysis. GFRP was used instead of carbon FRP (CFRP) in these tests. GFRP does not suffer from galvanic corrosion problems that may be a concern for CFRP directly bonded to steel; it also possesses a larger ultimate tensile strain, which is a favorable property for ductility enhancement applications. Teng and Hu (2006) presented results from the first series of tests on three CCFT columns in which the outer diameter-to-thickness  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "(D_{\\mathrm{outer}} / t_s)"
                    },
                    {
                        "type": "text",
                        "content": " ratio of the steel tube is 60. These tests showed that for CFT columns with steel tubes in which the effect of local buckling is limited, an FRP wrap can effectively enhance the strength of the column but not the ultimate axial strain. A theoretical model for predicting the axial compressive behavior of such CCFTs was also presented by Teng and Hu (2006). The present paper presents and interprets the results of three series of axial compression tests on CCFT columns in which thinner steel tubes were used. In CFTs with thinner steel tubes, the confinement from the steel tube is smaller, and the local buckling problem is more pronounced, so the benefit of FRP wrapping is expected to be more obvious. Thin steel tubes are also deemed to be particularly appropriate for CCFTs in which the additional confinement available in the critical regions allows the thickness of the steel tube to be reduced. All steel tubes used in the tests presented in this paper had a  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "D_{\\mathrm{outer}} / t_s"
                    },
                    {
                        "type": "text",
                        "content": " ratio exceeding 100. "
                    }
                ]
            },
            "bbox": [
                62,
                42,
                480,
                422
            ]
        },
        {
            "type": "title",
            "content": {
                "title_content": [
                    {
                        "type": "text",
                        "content": "Experimental Program "
                    }
                ],
                "level": 1
            },
            "bbox": [
                63,
                450,
                243,
                465
            ]
        },
        {
            "type": "title",
            "content": {
                "title_content": [
                    {
                        "type": "text",
                        "content": "Test Specimens "
                    }
                ],
                "level": 1
            },
            "bbox": [
                63,
                483,
                189,
                497
            ]
        },
        {
            "type": "paragraph",
            "content": {
                "paragraph_content": [
                    {
                        "type": "text",
                        "content": "In total, 12 specimens were prepared and tested in three series (Table 1). Each series included one concrete-filled steel tube (i.e., CFT) specimen and three FRP-confined CFT (i.e., CCFT) specimens with three different FRP wrap thicknesses. The steel tubes used in the same series had the same  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "D_{\\mathrm{outer}} / t_s"
                    },
                    {
                        "type": "text",
                        "content": " ratio, but the  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "D_{\\mathrm{outer}} / t_s"
                    },
                    {
                        "type": "text",
                        "content": " ratios were different for the different series. The concrete was cast in three batches for the three series but had the same mix ratio. All the specimens had an outer diameter of around  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "200~\\mathrm{mm}"
                    },
                    {
                        "type": "text",
                        "content": " and a height of  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "400~\\mathrm{mm}"
                    },
                    {
                        "type": "text",
                        "content": ". Other details of the specimens are summarized in Table 1. Each specimen was given a name, which starts with the letter F, followed by a number representing the number of plies in the FRP wrap. A second number (e.g., 102) "
                    }
                ]
            },
            "bbox": [
                62,
                503,
                480,
                674
            ]
        },
        {
            "type": "paragraph",
            "content": {
                "paragraph_content": [
                    {
                        "type": "text",
                        "content": "is used to indicate the  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "D_{\\mathrm{outer}} / t_s"
                    },
                    {
                        "type": "text",
                        "content": " ratio of the steel tube. For example, specimen F1-102 is a specimen that had a one-ply FRP wrap confining a steel tube with a  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "D_{\\mathrm{outer}} / t_s"
                    },
                    {
                        "type": "text",
                        "content": " ratio of 102. "
                    }
                ]
            },
            "bbox": [
                513,
                42,
                931,
                85
            ]
        },
        {
            "type": "title",
            "content": {
                "title_content": [
                    {
                        "type": "text",
                        "content": "Preparation of Specimens "
                    }
                ],
                "level": 1
            },
            "bbox": [
                514,
                99,
                714,
                114
            ]
        },
        {
            "type": "paragraph",
            "content": {
                "paragraph_content": [
                    {
                        "type": "text",
                        "content": "All steel tubes used in this experimental program were rolled from steel plates in a commercial workshop and welded in the laboratory. A stiff steel mold was used inside, and several steel belts were used outside during welding (Fig. 1) to achieve a nearly perfect shape and an accurate diameter for the tube. Before the casting of concrete, a  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "25\\mathrm{-mm}"
                    },
                    {
                        "type": "text",
                        "content": "-thick bottom steel plate was welded to each steel tube. This was followed by the casting of concrete into the steel tube with the top surface of concrete left rough. After several days of curing, a thin layer of gypsum was applied on the rough concrete surface, and then another  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "25\\mathrm{-mm}"
                    },
                    {
                        "type": "text",
                        "content": "-thick steel plate was welded to the other end of the column to close the steel tube. This procedure was adopted to minimize the effect of concrete shrinkage to ensure direct contact between the steel plates and the concrete infill so that the steel tube and the concrete can be loaded simultaneously during testing. "
                    }
                ]
            },
            "bbox": [
                511,
                119,
                931,
                328
            ]
        },
        {
            "type": "paragraph",
            "content": {
                "paragraph_content": [
                    {
                        "type": "text",
                        "content": "The GFRP wraps were formed by using the wet lay-up method with fibers in the hoop direction only. The steel tube surface was first cleaned with alcohol, and then a continuous unidirectional glass fiber sheet was wrapped around the steel tube to form a wrap with the required number of plies, with the finishing end of the fiber sheet overlapping its starting end by  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "200\\mathrm{mm}"
                    },
                    {
                        "type": "text",
                        "content": " (i.e., approximately the same as the diameter of the specimen; Fig. 2). The longitudinal welding seam of the steel tube was placed at the middle of the overlapping zone (Fig. 2). "
                    }
                ]
            },
            "bbox": [
                511,
                329,
                931,
                455
            ]
        },
        {
            "type": "title",
            "content": {
                "title_content": [
                    {
                        "type": "text",
                        "content": "Material Properties "
                    }
                ],
                "level": 1
            },
            "bbox": [
                514,
                470,
                661,
                484
            ]
        },
        {
            "type": "paragraph",
            "content": {
                "paragraph_content": [
                    {
                        "type": "text",
                        "content": "Three plain concrete cylinders  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "(152.5\\times 305\\mathrm{mm})"
                    },
                    {
                        "type": "text",
                        "content": " were tested for each series to determine the concrete properties. The average concrete elastic modulus  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "(E_{c})"
                    },
                    {
                        "type": "text",
                        "content": ", compressive strength  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "(f_{co}^{\\prime})"
                    },
                    {
                        "type": "text",
                        "content": ", and the corresponding strain  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "(\\varepsilon_{co})"
                    },
                    {
                        "type": "text",
                        "content": " obtained from these tests are given in Table 1. "
                    }
                ]
            },
            "bbox": [
                511,
                491,
                931,
                560
            ]
        },
        {
            "type": "paragraph",
            "content": {
                "paragraph_content": [
                    {
                        "type": "text",
                        "content": "Three types of steel plates, with thicknesses of  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "1\\mathrm{mm}"
                    },
                    {
                        "type": "text",
                        "content": ",  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "1.5\\mathrm{mm}"
                    },
                    {
                        "type": "text",
                        "content": " and  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "2\\mathrm{mm}"
                    },
                    {
                        "type": "text",
                        "content": " were used to fabricate the steel tubes to achieve three different  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "D_{\\mathrm{outer}} / t_s"
                    },
                    {
                        "type": "text",
                        "content": " ratios. Tensile tests of three steel coupons were conducted for each steel plate type following BS 18 (BS 18 1987). The average values of the elastic modulus  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "E_{s}"
                    },
                    {
                        "type": "text",
                        "content": ", yield stress  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "f_{y}"
                    },
                    {
                        "type": "text",
                        "content": ", and tensile strength  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "f_{u}"
                    },
                    {
                        "type": "text",
                        "content": " for each type of steel plate are given in Table 1. "
                    }
                ]
            },
            "bbox": [
                511,
                561,
                931,
                645
            ]
        },
        {
            "type": "paragraph",
            "content": {
                "paragraph_content": [
                    {
                        "type": "text",
                        "content": "Tensile tests of six FRP coupons with fibers oriented in the loading direction were conducted following the testing procedure "
                    }
                ]
            },
            "bbox": [
                511,
                645,
                931,
                672
            ]
        },
        {
            "type": "table",
            "content": {
                "image_source": {
                    "path": "images/51a43282c4a8dd00d1ee15c08cf05fe70b2980d93dbf49617088e58232a656af.jpg"
                },
                "table_caption": [
                    {
                        "type": "text",
                        "content": "Table 1. Details of Specimens "
                    }
                ],
                "table_footnote": [],
                "html": "<table><tr><td rowspan=\"2\">Series</td><td rowspan=\"2\">Specimen</td><td colspan=\"6\">Steel tube</td><td colspan=\"3\">Concrete</td><td colspan=\"2\">FRP</td></tr><tr><td>Douter(mm)</td><td>ts(mm)</td><td>Douter/ts</td><td>Es(GPa)</td><td>fy(MPa)</td><td>fu(MPa)</td><td>f′co(MPa)</td><td>Ec(GPa)</td><td>εco</td><td>tfp(mm)</td><td>Number of layers</td></tr><tr><td rowspan=\"4\">102</td><td>F0-102</td><td>204</td><td>2</td><td>102</td><td>203</td><td>226</td><td>331</td><td>42.2</td><td>27.9</td><td>0.00258</td><td>N/A</td><td>0</td></tr><tr><td>F1-102</td><td></td><td></td><td></td><td></td><td></td><td></td><td></td><td></td><td></td><td>0.17</td><td>1</td></tr><tr><td>F2-102</td><td></td><td></td><td></td><td></td><td></td><td></td><td></td><td></td><td></td><td>0.34</td><td>2</td></tr><tr><td>F3-102</td><td></td><td></td><td></td><td></td><td></td><td></td><td></td><td></td><td></td><td>0.51</td><td>3</td></tr><tr><td rowspan=\"4\">135</td><td>F0-135</td><td>203</td><td>1.5</td><td>135</td><td>204</td><td>242</td><td>349</td><td>42.1</td><td>28.8</td><td>0.00259</td><td>N/A</td><td>0</td></tr><tr><td>F2-135</td><td></td><td></td><td></td><td></td><td></td><td></td><td></td><td></td><td></td><td>0.34</td><td>2</td></tr><tr><td>F3-135</td><td></td><td></td><td></td><td></td><td></td><td></td><td></td><td></td><td></td><td>0.51</td><td>3</td></tr><tr><td>F4-135</td><td></td><td></td><td></td><td></td><td></td><td></td><td></td><td></td><td></td><td>0.68</td><td>4</td></tr><tr><td rowspan=\"4\">202</td><td>F0-202</td><td>202</td><td>1</td><td>202</td><td>203</td><td>231</td><td>334</td><td>35.9</td><td>26.7</td><td>0.00250</td><td>N/A</td><td>0</td></tr><tr><td>F2-202</td><td></td><td></td><td></td><td></td><td></td><td></td><td></td><td></td><td></td><td>0.34</td><td>2</td></tr><tr><td>F3-202</td><td></td><td></td><td></td><td></td><td></td><td></td><td></td><td></td><td></td><td>0.51</td><td>3</td></tr><tr><td>F4-202</td><td></td><td></td><td></td><td></td><td></td><td></td><td></td><td></td><td></td><td>0.68</td><td>4</td></tr></table>",
                "table_type": "complex_table",
                "table_nest_level": 1
            },
            "bbox": [
                63,
                705,
                931,
                934
            ]
        },
        {
            "type": "page_aside_text",
            "content": {
                "page_aside_text_content": [
                    {
                        "type": "text",
                        "content": "Downloaded from ascelibrary.org by Beijing University of Tech on 01/22/26. Copyright ASCE. For personal use only; all rights reserved. "
                    }
                ]
            },
            "bbox": [
                0,
                215,
                17,
                779
            ]
        },
        {
            "type": "page_footer",
            "content": {
                "page_footer_content": [
                    {
                        "type": "text",
                        "content": "JOURNAL OF COMPOSITES FOR CONSTRUCTION © ASCE / SEPTEMBER/OCTOBER 2011 / 851 "
                    }
                ]
            },
            "bbox": [
                330,
                949,
                931,
                962
            ]
        },
        {
            "type": "page_footer",
            "content": {
                "page_footer_content": [
                    {
                        "type": "text",
                        "content": "J. Compos. Constr., 2011, 15(5): 850-860 "
                    }
                ]
            },
            "bbox": [
                385,
                983,
                611,
                997
            ]
        }
    ],
    [
        {
            "type": "image",
            "content": {
                "image_source": {
                    "path": "images/cb12cb96f0235ffb83c73bc02d53740b7a49bd89a31a78f238494bd5aa24693a.jpg"
                },
                "image_caption": [
                    {
                        "type": "text",
                        "content": "Fig. 1. Mold for welding steel tubes "
                    }
                ],
                "image_footnote": []
            },
            "bbox": [
                106,
                37,
                442,
                277
            ]
        },
        {
            "type": "image",
            "content": {
                "image_source": {
                    "path": "images/0e2d2f9e3b1c999f56289aa30552cfde5e98cbc08f833e28504397451c4bd3cd.jpg"
                },
                "image_caption": [
                    {
                        "type": "text",
                        "content": "Fig. 2. Layout of strain gauges at midheight "
                    }
                ],
                "image_footnote": []
            },
            "bbox": [
                66,
                342,
                478,
                559
            ]
        },
        {
            "type": "paragraph",
            "content": {
                "paragraph_content": [
                    {
                        "type": "text",
                        "content": "specified in ASTM D3039 (2000). The test results showed that the FRP used in the study had an average elastic modulus of  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "80.1\\mathrm{GPa}"
                    },
                    {
                        "type": "text",
                        "content": " and an average ultimate strain of  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "2.28\\%"
                    },
                    {
                        "type": "text",
                        "content": " based on a nominal thickness of  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "0.17\\mathrm{mm}"
                    },
                    {
                        "type": "text",
                        "content": " per ply. The nominal thickness is the effective thickness of the fibers without consideration of the resin. The FRP wrap thickness  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "t_{\\mathrm{frp}}"
                    },
                    {
                        "type": "text",
                        "content": ", given in Table 1, is also the nominal thickness and is equal to  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "0.17\\mathrm{mm}"
                    },
                    {
                        "type": "text",
                        "content": " times the number of plies of the wrap. "
                    }
                ]
            },
            "bbox": [
                62,
                614,
                482,
                715
            ]
        },
        {
            "type": "title",
            "content": {
                "title_content": [
                    {
                        "type": "text",
                        "content": "Instrumentation and Loading "
                    }
                ],
                "level": 1
            },
            "bbox": [
                63,
                720,
                285,
                736
            ]
        },
        {
            "type": "paragraph",
            "content": {
                "paragraph_content": [
                    {
                        "type": "text",
                        "content": "For each FRP-confined CFT specimen, six strain gauges in the hoop direction and two strain gauges in the axial direction were installed at the midheight of the FRP wrap (Fig. 2). The two axial strain gauges were at  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "180^{\\circ}"
                    },
                    {
                        "type": "text",
                        "content": " apart from each other, both being located outside the overlapping zone. Of the six hoop strain gauges, one of them was inside the overlapping zone, whereas the other five were evenly distributed within the half circumference opposite the overlapping zone. Beside the midheight strain gauges, five strain gauges in the hoop direction were installed near  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "(20\\mathrm{mm}"
                    },
                    {
                        "type": "text",
                        "content": " from) each end of the specimen to measure any buckling deformation that would occur in those regions. The circumferential locations of these strain gauges were the same as the five midheight hoop strain gauges outside the overlapping zone. The layout of the strain gauges on each bare CFT specimen was exactly the same as that for FRP-confined "
                    }
                ]
            },
            "bbox": [
                62,
                741,
                482,
                936
            ]
        },
        {
            "type": "image",
            "content": {
                "image_source": {
                    "path": "images/5f227c5fb9d4cef860a2871a36eb9546344d02d843dd12fd92f7bfbad26aa658.jpg"
                },
                "image_caption": [
                    {
                        "type": "text",
                        "content": "Fig. 3. Test setup "
                    }
                ],
                "image_footnote": []
            },
            "bbox": [
                578,
                37,
                870,
                287
            ]
        },
        {
            "type": "paragraph",
            "content": {
                "paragraph_content": [
                    {
                        "type": "text",
                        "content": "specimens. All strain gauges on FRP-confined CFT specimens had a gauge length of  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "20\\mathrm{mm}"
                    },
                    {
                        "type": "text",
                        "content": ", whereas those on CFT specimens had a gauge length of  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "5\\mathrm{mm}"
                    },
                    {
                        "type": "text",
                        "content": ". "
                    }
                ]
            },
            "bbox": [
                513,
                340,
                933,
                383
            ]
        },
        {
            "type": "paragraph",
            "content": {
                "paragraph_content": [
                    {
                        "type": "text",
                        "content": "All the axial compression tests were conducted with a mechanical test system (MTS) machine (Fig. 3) with a displacement control rate of  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "0.5\\mathrm{mm / min}"
                    },
                    {
                        "type": "text",
                        "content": " until failure. The total axial shortening of the specimen was measured with three linear variable displacement transducers (LVDTs) placed  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "120^{\\circ}"
                    },
                    {
                        "type": "text",
                        "content": " apart from each other. All the test data, including the strains, loads, and displacements, were recorded simultaneously by a data logger. "
                    }
                ]
            },
            "bbox": [
                513,
                383,
                933,
                484
            ]
        },
        {
            "type": "title",
            "content": {
                "title_content": [
                    {
                        "type": "text",
                        "content": "Experimental Results and Observations "
                    }
                ],
                "level": 1
            },
            "bbox": [
                514,
                510,
                830,
                526
            ]
        },
        {
            "type": "title",
            "content": {
                "title_content": [
                    {
                        "type": "text",
                        "content": "General Observations "
                    }
                ],
                "level": 1
            },
            "bbox": [
                514,
                544,
                683,
                558
            ]
        },
        {
            "type": "paragraph",
            "content": {
                "paragraph_content": [
                    {
                        "type": "text",
                        "content": "All bare CFT specimens experienced continuous dilation in the midheight region and localized outward buckling of the steel tube near both ends of the tube at large axial shortenings (Fig. 4). The load decreased rapidly after the peak load had been reached (Fig. 5). "
                    }
                ]
            },
            "bbox": [
                513,
                565,
                933,
                637
            ]
        },
        {
            "type": "paragraph",
            "content": {
                "paragraph_content": [
                    {
                        "type": "text",
                        "content": "All FRP-confined CFT specimens failed by explosive rupture of the FRP wrap in the midheight region as a result of the lateral expansion of the concrete, leading to a sudden and rapid load drop. Before this final failure, localized FRP rupture occurred near one end in some of the specimens (i.e., specimens F2-102, "
                    }
                ]
            },
            "bbox": [
                513,
                637,
                933,
                709
            ]
        },
        {
            "type": "image",
            "content": {
                "image_source": {
                    "path": "images/47c40c8c9f3fbea7d6fa8c075d5d311d5608aeb91df37b40bfacd5796b713b27.jpg"
                },
                "image_caption": [
                    {
                        "type": "text",
                        "content": "Fig. 4. Failure modes of selected test specimens "
                    }
                ],
                "image_footnote": []
            },
            "bbox": [
                517,
                731,
                929,
                906
            ]
        },
        {
            "type": "page_aside_text",
            "content": {
                "page_aside_text_content": [
                    {
                        "type": "text",
                        "content": "Downloaded from ascelibrary.org by Beijing University of Tech on 01/22/26. Copyright ASCE. For personal use only; all rights reserved. "
                    }
                ]
            },
            "bbox": [
                0,
                215,
                17,
                779
            ]
        },
        {
            "type": "page_footer",
            "content": {
                "page_footer_content": [
                    {
                        "type": "text",
                        "content": "852 / JOURNAL OF COMPOSITES FOR CONSTRUCTION © ASCE / SEPTEMBER/OCTOBER 2011 "
                    }
                ]
            },
            "bbox": [
                63,
                949,
                665,
                963
            ]
        },
        {
            "type": "page_footer",
            "content": {
                "page_footer_content": [
                    {
                        "type": "text",
                        "content": "J. Compos. Constr., 2011, 15(5): 850-860 "
                    }
                ]
            },
            "bbox": [
                385,
                984,
                611,
                997
            ]
        }
    ],
    [
        {
            "type": "image",
            "content": {
                "image_source": {
                    "path": "images/a206fd9693b3a5d268051cd75c5734bb39342438b1474e82653bfcad206b1f2a.jpg"
                },
                "image_caption": [
                    {
                        "type": "text",
                        "content": "(a) Series 102 "
                    }
                ],
                "image_footnote": []
            },
            "bbox": [
                112,
                36,
                433,
                210
            ]
        },
        {
            "type": "image",
            "content": {
                "image_source": {
                    "path": "images/a113cb22169d64a27a434cd330db9eae898fe5841b36a8759e411bbb5fa4ea96.jpg"
                },
                "image_caption": [
                    {
                        "type": "text",
                        "content": "(b) Series 135 "
                    }
                ],
                "image_footnote": []
            },
            "bbox": [
                116,
                236,
                429,
                416
            ]
        },
        {
            "type": "image",
            "content": {
                "image_source": {
                    "path": "images/4ac91a8feb4ebae140c26282555e3cd334a61c5a876cc33309f1187f4737c3e6.jpg"
                },
                "image_caption": [
                    {
                        "type": "text",
                        "content": "(c) Series 202 "
                    },
                    {
                        "type": "text",
                        "content": "Fig. 5. Axial load-axial shortening curves; (a) series 102, (b) series 135, (c) series 202 "
                    }
                ],
                "image_footnote": []
            },
            "bbox": [
                116,
                440,
                428,
                618
            ]
        },
        {
            "type": "paragraph",
            "content": {
                "paragraph_content": [
                    {
                        "type": "text",
                        "content": "F3-102, and F2-135) as a result of the localized outward buckling deformation of the steel tube, but this local FRP rupture only had a small effect on the load-carrying capacity of the specimen [see Figs. 5(a) and 5(b)]. "
                    }
                ]
            },
            "bbox": [
                62,
                702,
                482,
                761
            ]
        },
        {
            "type": "title",
            "content": {
                "title_content": [
                    {
                        "type": "text",
                        "content": "Axial Load-Axial Shortening Behavior "
                    }
                ],
                "level": 1
            },
            "bbox": [
                63,
                770,
                354,
                787
            ]
        },
        {
            "type": "paragraph",
            "content": {
                "paragraph_content": [
                    {
                        "type": "text",
                        "content": "The axial load-axial shortening curves of all specimens are shown in Fig. 5, in which the axial shortening is the average value of the three LVDTs. The curves of all CFT specimens feature a smooth but relatively steep descending branch after the peak load, whereas those of the FRP-confined specimens either have an approximately elastic-perfectly plastic curve or an approximately bilinear curve before final failure, which is associated with a sudden load drop. "
                    }
                ]
            },
            "bbox": [
                62,
                794,
                480,
                893
            ]
        },
        {
            "type": "paragraph",
            "content": {
                "paragraph_content": [
                    {
                        "type": "text",
                        "content": "The key test results for all specimens are summarized in Table 2. Here,  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "N_{u}"
                    },
                    {
                        "type": "text",
                        "content": " and  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "\\delta_{u}"
                    },
                    {
                        "type": "text",
                        "content": ", respectively, are the load and the axial shortening of a specimen at the ultimate state;  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "N_{c}"
                    },
                    {
                        "type": "text",
                        "content": " is the peak load;  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "\\varepsilon_{\\mathrm{fp},\\mathrm{rupt}}"
                    },
                    {
                        "type": "text",
                        "content": " is the "
                    }
                ]
            },
            "bbox": [
                62,
                893,
                480,
                938
            ]
        },
        {
            "type": "paragraph",
            "content": {
                "paragraph_content": [
                    {
                        "type": "text",
                        "content": "The ultimate state of the FRP is defined as the time when the load is reduced to  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "80\\%"
                    },
                    {
                        "type": "text",
                        "content": " of the F2-102. The ultimate state of the FRP confined CFT specimens is defined as the time when the load is reduced to  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "80\\%"
                    },
                    {
                        "type": "text",
                        "content": " of the F2-103. The ultimate state of the FRP confined CFT specimens is defined as the time when the load is reduced to  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "80\\%"
                    },
                    {
                        "type": "text",
                        "content": " of the F2-104. The ultimate state of the FRP confined CFT specimens is defined as the time when the load is reduced to  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "80\\%"
                    },
                    {
                        "type": "text",
                        "content": " of the F2-105. "
                    }
                ]
            },
            "bbox": [
                511,
                42,
                934,
                250
            ]
        },
        {
            "type": "paragraph",
            "content": {
                "paragraph_content": [
                    {
                        "type": "text",
                        "content": "The effect of FRP confinement is evident in Fig. 5 and Table 2. With this additional confinement, the load-carrying capacity can be increased by  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "60\\%"
                    },
                    {
                        "type": "text",
                        "content": ", whereas the axial shortening capacity can be increased by up to  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "153\\%"
                    },
                    {
                        "type": "text",
                        "content": "; the energy dissipation capacity is also much enhanced. As expected, a thicker FRP wrap led to a greater enhancement in performance. For the same FRP wrap thickness, the degree of enhancement in the load-carrying capacity is seen to be greater for CFTs with a thinner steel tube in which the contribution of the steel tube to the load-carrying capacity is smaller. "
                    }
                ]
            },
            "bbox": [
                511,
                250,
                934,
                377
            ]
        },
        {
            "type": "title",
            "content": {
                "title_content": [
                    {
                        "type": "text",
                        "content": "Nominal Axial Strains versus Axial Strain Gauge Readings "
                    }
                ],
                "level": 1
            },
            "bbox": [
                513,
                387,
                882,
                417
            ]
        },
        {
            "type": "paragraph",
            "content": {
                "paragraph_content": [
                    {
                        "type": "text",
                        "content": "There are two ways to obtain the axial strain of a specimen. One is to take the axial strain as the average reading from the two mid-height axial strain gauges, and the other is to take it as the average strain over the whole height of the specimen on the basis of the average overall axial shortening of the three LVDTs. The strain value obtained from the latter approach is referred to as the nominal axial strain in this paper. "
                    }
                ]
            },
            "bbox": [
                511,
                422,
                933,
                520
            ]
        },
        {
            "type": "paragraph",
            "content": {
                "paragraph_content": [
                    {
                        "type": "text",
                        "content": "Fig. 6 shows a comparison between the nominal axial strain and the axial strain gauge reading for all specimens except specimen F1-102, in which the two axial strain gauges were damaged during the test. The axial strain gauge readings shown in Fig. 6 were averaged from those of the two axial strain gauges except for specimen F2-135. In specimen F2-135, one of the axial strain gauges was damaged, so the readings from the only surviving axial strain gauge are shown. For the specimens of series 102 (except specimen F1-102), Fig. 6(a) shows that the axial strains found by using both approaches are in close agreement until a threshold strain value (around 0.008), beyond which the nominal axial strain becomes significantly larger than the axial strain gauge reading, indicating that significant localized deformation occurred outside the midheight region of the steel tube. This is consistent with the experimental observation that significant localized buckling deformation occurred near both ends in specimen F0-102 and near one of the ends in specimens F2-102 and F3-102. The outward buckling deformation caused localized FRP rupture near one of the ends of specimens F2-102 and F3-102. The same trend can also be seen for specimen F2-135 and the two bare CFT specimens of series 135 and series 202 (Fig. 6), in which localized buckling deformation also appeared in the later stage of loading. On the contrary, for all the other FRP-confined specimens [see Figs. 6(b) and 6(c)], the axial strains obtained from both approaches are similar throughout the entire loading process, indicating that localized buckling deformation was not significant in these specimens. "
                    }
                ]
            },
            "bbox": [
                511,
                520,
                933,
                880
            ]
        },
        {
            "type": "paragraph",
            "content": {
                "paragraph_content": [
                    {
                        "type": "text",
                        "content": "As the axial stiffness of the FRP wrap is very small and the local buckling deformation of the steel tube is outward, it is reasonable to expect that the slip between the FRP wrap and the steel tube, if any, is very limited. Therefore, readings from the axial strain gauges, "
                    }
                ]
            },
            "bbox": [
                511,
                880,
                933,
                938
            ]
        },
        {
            "type": "page_aside_text",
            "content": {
                "page_aside_text_content": [
                    {
                        "type": "text",
                        "content": "Downloaded from asccelibrary.org by Beijing University of Tech on 01/22/26. Copyright ASCE. For personal use only; all rights reserved. "
                    }
                ]
            },
            "bbox": [
                0,
                217,
                17,
                779
            ]
        },
        {
            "type": "page_footer",
            "content": {
                "page_footer_content": [
                    {
                        "type": "text",
                        "content": "JOURNAL OF COMPOSITES FOR CONSTRUCTION © ASCE / SEPTEMBER/OCTOBER 2011 / 853 "
                    }
                ]
            },
            "bbox": [
                330,
                949,
                931,
                963
            ]
        },
        {
            "type": "page_footer",
            "content": {
                "page_footer_content": [
                    {
                        "type": "text",
                        "content": "J. Compos. Constr., 2011, 15(5): 850-860 "
                    }
                ]
            },
            "bbox": [
                385,
                984,
                611,
                997
            ]
        }
    ],
    [
        {
            "type": "table",
            "content": {
                "image_source": {
                    "path": "images/6ef7fc4302dbaa164285c6fe86318b313c94243a77112d66b67fe41fae3e2548.jpg"
                },
                "table_caption": [
                    {
                        "type": "text",
                        "content": "Table 2. Summary of Test Results "
                    }
                ],
                "table_footnote": [],
                "html": "<table><tr><td>Series</td><td>Specimen</td><td>Nc(kN)</td><td>Nu(kN)</td><td>Nu/Nc,bare</td><td>δu(mm)</td><td>δu/δu,bare</td><td>εfrp,rupt</td></tr><tr><td rowspan=\"4\">102</td><td>F0-102</td><td>1864</td><td>1491</td><td>0.8</td><td>3.72</td><td>1</td><td>N/A</td></tr><tr><td>F1-102</td><td>1993</td><td>1878</td><td>1.01</td><td>5.28</td><td>1.42</td><td>-0.0179</td></tr><tr><td>F2-102</td><td>2172</td><td>2127</td><td>1.14</td><td>8.45</td><td>2.27</td><td>-0.0199</td></tr><tr><td>F3-102</td><td>2427</td><td>2231</td><td>1.20</td><td>9.43</td><td>2.53</td><td>-0.019</td></tr><tr><td rowspan=\"4\">135</td><td>F0-135</td><td>1699</td><td>1359</td><td>0.8</td><td>3.60</td><td>1</td><td>N/A</td></tr><tr><td>F2-135</td><td>2014</td><td>1950</td><td>1.15</td><td>6.20</td><td>1.72</td><td>-0.0161</td></tr><tr><td>F3-135</td><td>2244</td><td>2244</td><td>1.32</td><td>6.85</td><td>1.90</td><td>-0.0167</td></tr><tr><td>F4-135</td><td>2561</td><td>2561</td><td>1.51</td><td>7.52</td><td>2.09</td><td>-0.0179</td></tr><tr><td rowspan=\"4\">202</td><td>F0-202</td><td>1380</td><td>1104</td><td>0.8</td><td>4.09</td><td>1</td><td>N/A</td></tr><tr><td>F2-202</td><td>1749</td><td>1710</td><td>1.24</td><td>6.73</td><td>1.65</td><td>-0.0212</td></tr><tr><td>F3-202</td><td>1961</td><td>1961</td><td>1.42</td><td>7.76</td><td>1.90</td><td>-0.0191</td></tr><tr><td>F4-202</td><td>2265</td><td>2265</td><td>1.64</td><td>8.68</td><td>2.12</td><td>-0.0192</td></tr></table>",
                "table_type": "complex_table",
                "table_nest_level": 1
            },
            "bbox": [
                63,
                55,
                936,
                265
            ]
        },
        {
            "type": "image",
            "content": {
                "image_source": {
                    "path": "images/e9dedaf6abdf15de3e13cf55e88121c890f29a69ab91fe983039c6a9ea7b27b8.jpg"
                },
                "image_caption": [],
                "image_footnote": []
            },
            "bbox": [
                116,
                294,
                428,
                489
            ]
        },
        {
            "type": "image",
            "content": {
                "image_source": {
                    "path": "images/00d0f8ab13dd9e688d7a88fab96ec443be74d9d98aa37285df4c1f85f571b598.jpg"
                },
                "image_caption": [
                    {
                        "type": "text",
                        "content": "Fig. 6. Nominal axial strain versus axial strain gauge reading; (a) series 102, (b) series 135, (c) series 202 "
                    }
                ],
                "image_footnote": []
            },
            "bbox": [
                116,
                496,
                428,
                893
            ]
        },
        {
            "type": "paragraph",
            "content": {
                "paragraph_content": [
                    {
                        "type": "text",
                        "content": "which were attached to the FRP wrap, can be taken to closely reflect the strain state of the steel tube at the midheight. These axial strain gauge readings were thus employed in the analysis of the stress state of the steel tube in the present study. By contrast, significant slips may have existed between the steel tube and the concrete, especially after the development of localized buckling deformation of the steel tube, which means that the axial strain gauge readings cannot be assumed to closely reflect the strain state of the confined concrete. In the subsequent sections, the nominal axial strain is used to represent the axial strain of the confined concrete. The nominal axial strain represents the average deformation of the concrete over the column height, in which the deformation near the ends may be different from that near the midheight because of the lateral constraints from the two ends. Nevertheless, the nominal axial strain still reflects better the behavior of the confined concrete as it does not suffer from the effect of the buckling of the steel tube. "
                    }
                ]
            },
            "bbox": [
                511,
                292,
                933,
                517
            ]
        },
        {
            "type": "title",
            "content": {
                "title_content": [
                    {
                        "type": "text",
                        "content": "Behavior of the Steel Tube "
                    }
                ],
                "level": 1
            },
            "bbox": [
                514,
                542,
                728,
                556
            ]
        },
        {
            "type": "paragraph",
            "content": {
                "paragraph_content": [
                    {
                        "type": "text",
                        "content": "In this section, the stress state of the steel tube in the CFTs and CCFTs is examined, from which the axial load taken and the confining pressure provided by the steel tube can be obtained, and thus a better understanding of the behavior of the confined concrete can be reached. Assuming that the steel tube of a bare or FRP-confined CFT specimen is in a state of plane stresses, the stress state of the midheight section of the tube during the loading process can be determined from the two strains (i.e., the axial strain and the hoop strain) through an incremental analysis based on the  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "J_{2}"
                    },
                    {
                        "type": "text",
                        "content": " flow theory of plasticity (Calladine 1985). In the present study, the steel is simply assumed to be an elastic-perfectly plastic material. The analysis basically involves the calculation of stress increments from strain increments by using the following two equations [Eq. (1) for the elastic range and Eq. (2) for the elastic-plastic range]: "
                    }
                ]
            },
            "bbox": [
                511,
                566,
                933,
                763
            ]
        },
        {
            "type": "equation_interline",
            "content": {
                "math_content": "\\left\\{ \\begin{array}{l} d \\sigma_ {x} ^ {i} \\\\ d \\sigma_ {\\theta} ^ {i} \\end{array} \\right\\} = \\frac {E _ {s}}{1 - \\nu^ {2}} \\left[ \\begin{array}{c c} 1 & \\nu \\\\ \\nu & 1 \\end{array} \\right] \\left\\{ \\begin{array}{l} d \\varepsilon_ {x} ^ {i} \\\\ d \\varepsilon_ {\\theta} ^ {i} \\end{array} \\right\\} \\tag {1}",
                "math_type": "latex",
                "image_source": {
                    "path": "images/7462dde1df207e7e4360a895019d2411d1508b43c0c75a29c26ef4b5e4898810.jpg"
                }
            },
            "bbox": [
                609,
                773,
                931,
                815
            ]
        },
        {
            "type": "equation_interline",
            "content": {
                "math_content": "\\left\\{ \\begin{array}{l} d \\sigma_ {x} ^ {i} \\\\ d \\sigma_ {\\theta} ^ {i} \\end{array} \\right\\} = \\frac {E _ {s}}{1 - \\nu^ {2}} \\left[ \\begin{array}{c c} 1 - \\left(S _ {a} ^ {2} / S _ {c}\\right) & \\nu - \\left(S _ {a} S _ {b} / S _ {c}\\right) \\\\ \\nu - \\left(S _ {a} S _ {b} / S _ {c}\\right) & 1 - \\left(S _ {b} ^ {2} / S _ {c}\\right) \\end{array} \\right] \\left\\{ \\begin{array}{l} d \\varepsilon_ {x} ^ {i} \\\\ d \\varepsilon_ {\\theta} ^ {i} \\end{array} \\right\\} \\tag {2}",
                "math_type": "latex",
                "image_source": {
                    "path": "images/4de298ec912e86f7ed61dff3b7514dc82b73532ad9b60c5f5516070a713aaa76.jpg"
                }
            },
            "bbox": [
                516,
                845,
                931,
                887
            ]
        },
        {
            "type": "paragraph",
            "content": {
                "paragraph_content": [
                    {
                        "type": "text",
                        "content": "in which "
                    }
                ]
            },
            "bbox": [
                514,
                898,
                576,
                912
            ]
        },
        {
            "type": "equation_interline",
            "content": {
                "math_content": "S _ {a} = s _ {x} + \\nu s _ {\\theta} \\tag {3}",
                "math_type": "latex",
                "image_source": {
                    "path": "images/ba0397fecce520d678a032307e513ed61a5e19931eb1a092268eea7c3eca92c6.jpg"
                }
            },
            "bbox": [
                678,
                919,
                931,
                934
            ]
        },
        {
            "type": "page_aside_text",
            "content": {
                "page_aside_text_content": [
                    {
                        "type": "text",
                        "content": "Downloaded from asccelibrary.org by Beijing University of Tech on 01/22/26. Copyright ASCE. For personal use only; all rights reserved. "
                    }
                ]
            },
            "bbox": [
                0,
                217,
                17,
                779
            ]
        },
        {
            "type": "page_footer",
            "content": {
                "page_footer_content": [
                    {
                        "type": "text",
                        "content": "854 / JOURNAL OF COMPOSITES FOR CONSTRUCTION © ASCE / SEPTEMBER/OCTOBER 2011 "
                    }
                ]
            },
            "bbox": [
                63,
                949,
                665,
                963
            ]
        },
        {
            "type": "page_footer",
            "content": {
                "page_footer_content": [
                    {
                        "type": "text",
                        "content": "J. Compos. Constr., 2011, 15(5): 850-860 "
                    }
                ]
            },
            "bbox": [
                385,
                984,
                611,
                997
            ]
        }
    ],
    [
        {
            "type": "equation_interline",
            "content": {
                "math_content": "S _ {b} = s _ {\\theta} + \\nu s _ {x} \\tag {4}",
                "math_type": "latex",
                "image_source": {
                    "path": "images/2693f0700c08368f7b8a7e2bda8e88b54b570bb53dd65bd058968bf8f6c05ed9.jpg"
                }
            },
            "bbox": [
                225,
                42,
                480,
                59
            ]
        },
        {
            "type": "equation_interline",
            "content": {
                "math_content": "S _ {c} = s _ {x} ^ {2} + s _ {\\theta} ^ {2} + 2 \\nu s _ {x} s _ {\\theta} \\tag {5}",
                "math_type": "latex",
                "image_source": {
                    "path": "images/5f8d172e45be7beccfb9a821abad70bce37ac2aea13659b11f071ca3410da461.jpg"
                }
            },
            "bbox": [
                202,
                83,
                480,
                102
            ]
        },
        {
            "type": "equation_interline",
            "content": {
                "math_content": "s _ {x} = \\frac {1}{3} \\left(2 \\sigma_ {x} ^ {i - 1} - \\sigma_ {\\theta} ^ {i - 1}\\right) \\tag {6}",
                "math_type": "latex",
                "image_source": {
                    "path": "images/fc4da29b288ac5df02b33360558596810d236610b372d42c413378fd31bcd92c.jpg"
                }
            },
            "bbox": [
                202,
                128,
                480,
                156
            ]
        },
        {
            "type": "equation_interline",
            "content": {
                "math_content": "s _ {\\theta} = \\frac {1}{3} \\left(2 \\sigma_ {\\theta} ^ {i - 1} - \\sigma_ {x} ^ {i - 1}\\right) \\tag {7}",
                "math_type": "latex",
                "image_source": {
                    "path": "images/0254b0e6f771a1f2d983b08a84f0b7166a8ee3df0b6d075693876cbcddf42272.jpg"
                }
            },
            "bbox": [
                202,
                181,
                480,
                210
            ]
        },
        {
            "type": "paragraph",
            "content": {
                "paragraph_content": [
                    {
                        "type": "text",
                        "content": "in which  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "\\sigma_{x}"
                    },
                    {
                        "type": "text",
                        "content": " and  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "\\sigma_{\\theta} ="
                    },
                    {
                        "type": "text",
                        "content": " axial and hoop stresses, respectively;  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "\\varepsilon_{x}"
                    },
                    {
                        "type": "text",
                        "content": " and  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "\\varepsilon_{\\theta} ="
                    },
                    {
                        "type": "text",
                        "content": " axial and hoop strains, respectively;  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "E_{s}"
                    },
                    {
                        "type": "text",
                        "content": " and  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "\\nu ="
                    },
                    {
                        "type": "text",
                        "content": " elastic modulus and Poisson's ratio of the steel, respectively; and  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "i"
                    },
                    {
                        "type": "text",
                        "content": " is the present strain increment number. The von Mises yield criterion is employed to identify whether the steel tube has yielded or not and is given by "
                    }
                ]
            },
            "bbox": [
                63,
                219,
                480,
                291
            ]
        },
        {
            "type": "equation_interline",
            "content": {
                "math_content": "\\left(\\sigma_ {x} ^ {i - 1}\\right) ^ {2} + \\left(\\sigma_ {\\theta} ^ {i - 1}\\right) ^ {2} + \\sigma_ {x} ^ {i - 1} \\sigma_ {\\theta} ^ {i - 1} - f _ {y} ^ {2} = 0 \\tag {8}",
                "math_type": "latex",
                "image_source": {
                    "path": "images/7350a49e187d6fd864a60278f0dbfdb03833d9679c46423e14b58ca55ca3298f.jpg"
                }
            },
            "bbox": [
                150,
                297,
                480,
                316
            ]
        },
        {
            "type": "paragraph",
            "content": {
                "paragraph_content": [
                    {
                        "type": "text",
                        "content": "in which  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "f_{y} ="
                    },
                    {
                        "type": "text",
                        "content": " yield stress. In the process of evaluating the stress state of a steel tube with Eqs. (1)-(8), tensile stresses and strains are defined to be negative, whereas compressive stresses and strains are defined to be positive. This sign convention for stresses and strains are used throughout the paper unless otherwise specified. "
                    }
                ]
            },
            "bbox": [
                62,
                325,
                480,
                395
            ]
        },
        {
            "type": "paragraph",
            "content": {
                "paragraph_content": [
                    {
                        "type": "text",
                        "content": "As a result of measurement noises, the difference between two consecutive strain gauge readings, being a very small quantity, may be in significant error. Therefore, for some of the specimens (i.e., all bare CFT specimens, F2-102 and F3-102), the experimental axial strain-hoop strain curves were smoothened before being employed to calculate the stress state of the steel tube. As an illustration of this process, Fig. 7 shows a comparison of the experimental and smoothened axial strain-hoop strain curves for specimen F3-102 and the corresponding axial stress-strain curves; the comparisons of experimental and smoothened curves for other specimens are similar. The stress states obtained from the smoothened axial strain-hoop strain curves are referred to in the subsequent discussions unless otherwise specified. "
                    }
                ]
            },
            "bbox": [
                62,
                395,
                480,
                575
            ]
        },
        {
            "type": "paragraph",
            "content": {
                "paragraph_content": [
                    {
                        "type": "text",
                        "content": "The axial stress-strain curves of the steel tubes obtained from the incremental approach previously presented are shown in Fig. 8 for all specimens except F1-102. In the calculation, the Poisson's ratio of steel was assumed to be 0.3. All curves are terminated at the ultimate state except those of specimens F2-102, F3-102, and F4-135, which are terminated at the failure of one of the axial strain gauges. Fig. 8 shows that all steel tubes behaved linear elastically in the initial stage until a stress level approximately equal to or slightly higher than the yield stress of the steel tube. The slight difference between the peak stress and the steel yield stress of the steel tube, mainly for FRP-confined CFT specimens, is attributed to the positive effect of FRP confinement. After the peak load point, the axial stress begins to decrease with the axial strain because of the increasing hoop tensile stresses induced by the lateral expansion of the concrete. The axial stress keeps decreasing until the attainment of the ultimate state for all bare CFT specimens and some of the FRP-confined specimens (i.e., specimens F2-102, F3-102, F2-135, referred to as Type I specimens hereafter) but remains approximately constant or increases slowly in the final stage of deformation for the other FRP-confined specimens (e.g., specimens F3-135, F4-135, and all specimens of series 202, referred to as Type II specimens hereafter). For Type I specimens, localized buckling deformation occurred near both ends in bare CFT specimens and near one of the ends in the FRP-confined specimens, which resulted in a very slow increase in the axial strain at the midheight [see Figs. 6(a) and 6(b) in the final stage of deformation]. This slow "
                    }
                ]
            },
            "bbox": [
                62,
                575,
                482,
                936
            ]
        },
        {
            "type": "image",
            "content": {
                "image_source": {
                    "path": "images/991bc856f33e2d1c849ff7009648d708b759e030b22393fb089d83af9a434003.jpg"
                },
                "image_caption": [
                    {
                        "type": "text",
                        "content": "(a) Axial strain hoop strain curve "
                    }
                ],
                "image_footnote": []
            },
            "bbox": [
                555,
                37,
                890,
                229
            ]
        },
        {
            "type": "image",
            "content": {
                "image_source": {
                    "path": "images/f7e63265fcb0e0d5821bef57544ec391ec29733192f8e4e4a7cb35a8c1355a30.jpg"
                },
                "image_caption": [
                    {
                        "type": "text",
                        "content": "(b) Axial stress strain curve "
                    },
                    {
                        "type": "text",
                        "content": "Fig. 7. Axial stress-strain curves for specimen F3-102 based on the original and smoothened axial strain-hoop strain curves; (a) axial strain-hoop strain curve, (b) axial stress-strain curve "
                    }
                ],
                "image_footnote": []
            },
            "bbox": [
                566,
                252,
                890,
                445
            ]
        },
        {
            "type": "paragraph",
            "content": {
                "paragraph_content": [
                    {
                        "type": "text",
                        "content": "increase in the axial strain, together with the much more rapid increase in the hoop expansion, led to a continuously decreasing axial stress. The instants of initiation of localized buckling deformation, as determined from Fig. 6, are shown in Fig. 8, to show how local buckling deformation affects the development of axial stress in the steel tube. Similar observations have been made by O'Shea and Bridge (1999) about concrete-filled steel tubes; they concluded that the end buckling of a steel tube prevents the axial load transfer. On the contrary, for Type II specimens in which local buckling deformation was not detected, the axial strain of the midheight steel section kept increasing during the loading process and the lateral expansion of the concrete was eventually counterbalanced by the confinement of the FRP wrap, leading to an almost constant axial stress in the final stage of deformation. "
                    }
                ]
            },
            "bbox": [
                511,
                540,
                933,
                738
            ]
        },
        {
            "type": "paragraph",
            "content": {
                "paragraph_content": [
                    {
                        "type": "text",
                        "content": "The midheight hoop stress in the steel tube obtained by using the incremental approach is shown against the nominal axial strain in Fig. 9 for all specimens except F1-102. In all cases, the hoop stress is seen to be positive (i.e., compressive) in the initial stage until an axial strain of around 0.002. This can be explained by noting that the initial Poisson's ratio of steel is larger than that of concrete and that of the FRP wrap, so the steel tube tended to expand more than the other two components, and interfacial radial stresses were thus development between them. That is, in the initial stage of loading, the steel tube was subjected to radial tensile stresses from the concrete as long as the bond between the steel tube and concrete did not break (Johansson and Gylltoft 2002) and radial compressive stresses from the FRP wrap (for FRP-confined CFT specimens), leading to compressive hoop stresses in the steel tube. "
                    }
                ]
            },
            "bbox": [
                511,
                738,
                933,
                936
            ]
        },
        {
            "type": "page_aside_text",
            "content": {
                "page_aside_text_content": [
                    {
                        "type": "text",
                        "content": "Downloaded from asccelibrary.org by Beijing University of Tech on 01/22/26. Copyright ASCE. For personal use only; all rights reserved. "
                    }
                ]
            },
            "bbox": [
                0,
                217,
                17,
                779
            ]
        },
        {
            "type": "page_footer",
            "content": {
                "page_footer_content": [
                    {
                        "type": "text",
                        "content": "JOURNAL OF COMPOSITES FOR CONSTRUCTION © ASCE / SEPTEMBER/OCTOBER 2011 / 855 "
                    }
                ]
            },
            "bbox": [
                330,
                949,
                931,
                962
            ]
        },
        {
            "type": "page_footer",
            "content": {
                "page_footer_content": [
                    {
                        "type": "text",
                        "content": "J. Compos. Constr., 2011, 15(5): 850-860 "
                    }
                ]
            },
            "bbox": [
                385,
                984,
                611,
                997
            ]
        }
    ],
    [
        {
            "type": "image",
            "content": {
                "image_source": {
                    "path": "images/d7bd5d24f7fb63e7fe4e457b56a8cb4c389a593119f9ad6731de39af63491818.jpg"
                },
                "image_caption": [
                    {
                        "type": "text",
                        "content": "(a) Series 102 "
                    }
                ],
                "image_footnote": []
            },
            "bbox": [
                107,
                36,
                442,
                224
            ]
        },
        {
            "type": "image",
            "content": {
                "image_source": {
                    "path": "images/02a5b6b5d41688c3636cdab8c81089fe514225569a38cb9451f3a596c1bd0819.jpg"
                },
                "image_caption": [
                    {
                        "type": "text",
                        "content": "(b) Series 135 "
                    }
                ],
                "image_footnote": []
            },
            "bbox": [
                106,
                244,
                436,
                431
            ]
        },
        {
            "type": "image",
            "content": {
                "image_source": {
                    "path": "images/cabb05302eb60ec73b3e8d4c78f0ac9d1e3ae4cec537a730d164d2e467dda929.jpg"
                },
                "image_caption": [
                    {
                        "type": "text",
                        "content": "(c) Series 202 "
                    },
                    {
                        "type": "text",
                        "content": "Fig. 8. Axial stress-strain curves for steel tubes; (a) series 102, (b) series 135, (c) series 202 "
                    }
                ],
                "image_footnote": []
            },
            "bbox": [
                102,
                454,
                442,
                633
            ]
        },
        {
            "type": "paragraph",
            "content": {
                "paragraph_content": [
                    {
                        "type": "text",
                        "content": "Beyond a certain axial strain level, the concrete began to expand more quickly than the steel tube, leading to tensile hoop stresses in the steel tube. The midheight hoop stress is seen to increase rapidly until an axial strain of around 0.006, after which the hoop stress either remains almost constant (for Type II specimens) or keeps increasing at a smaller rate (for Type I specimens; see Fig. 9). The same explanation as previously presented for the axial stress response also applies here to the hoop stress response, as after the yielding of steel, these two stresses are related by Eq. (8). "
                    }
                ]
            },
            "bbox": [
                62,
                707,
                482,
                835
            ]
        },
        {
            "type": "title",
            "content": {
                "title_content": [
                    {
                        "type": "text",
                        "content": "Behavior of the Confined Concrete "
                    }
                ],
                "level": 1
            },
            "bbox": [
                63,
                854,
                341,
                871
            ]
        },
        {
            "type": "title",
            "content": {
                "title_content": [
                    {
                        "type": "text",
                        "content": "Axial Stress-Strain Behavior "
                    }
                ],
                "level": 1
            },
            "bbox": [
                63,
                887,
                281,
                902
            ]
        },
        {
            "type": "paragraph",
            "content": {
                "paragraph_content": [
                    {
                        "type": "text",
                        "content": "Once the axial stress-strain curve of the steel tube is known, the axial load carried by the confined concrete can be found by "
                    }
                ]
            },
            "bbox": [
                63,
                907,
                482,
                938
            ]
        },
        {
            "type": "image",
            "content": {
                "image_source": {
                    "path": "images/44c11d7715fdec71232e1199d40540ef6eb37de8eee60ed6c3aa56d8c12ab1d9.jpg"
                },
                "image_caption": [
                    {
                        "type": "text",
                        "content": "(a) Series 102 "
                    }
                ],
                "image_footnote": []
            },
            "bbox": [
                555,
                36,
                888,
                219
            ]
        },
        {
            "type": "image",
            "content": {
                "image_source": {
                    "path": "images/e344692c549b54e4780431a2157fa47b160a8fda5f200b68aa9faf11122b4afd.jpg"
                },
                "image_caption": [
                    {
                        "type": "text",
                        "content": "(b) Series 135 "
                    }
                ],
                "image_footnote": []
            },
            "bbox": [
                558,
                243,
                879,
                426
            ]
        },
        {
            "type": "image",
            "content": {
                "image_source": {
                    "path": "images/c57d86b3734c78d15e5749c76247c5d15336411505639f4801461c04034e10d0.jpg"
                },
                "image_caption": [
                    {
                        "type": "text",
                        "content": "(c) Series 202 "
                    },
                    {
                        "type": "text",
                        "content": "Fig. 9. Hoop stress-axial strain curves for steel tubes; (a) series 102, (b) series 135, (c) series 202 "
                    }
                ],
                "image_footnote": []
            },
            "bbox": [
                558,
                450,
                867,
                633
            ]
        },
        {
            "type": "paragraph",
            "content": {
                "paragraph_content": [
                    {
                        "type": "text",
                        "content": "deducting the axial load carried by the steel tube from the total load acting on the specimen, assuming that the small axial stiffness of the FRP wrap is negligible. The axial stress of the confined concrete, assumed to be uniform within its cross section, can then be obtained by dividing the deduced load by its cross-sectional area. The nominal axial strain is used for interpreting the behavior of the confined concrete, as mentioned previously. The key values of the stress and the strain of the confined concrete deduced from this process are summarized in Table 3, in which  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "f_{cc}^{\\prime}"
                    },
                    {
                        "type": "text",
                        "content": " is the peak concrete stress;  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "f_{cc,\\text{bare}}^{\\prime}"
                    },
                    {
                        "type": "text",
                        "content": " is the peak concrete stress of the corresponding bare CFT specimen;  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "f_{cu}^{\\prime}"
                    },
                    {
                        "type": "text",
                        "content": " and  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "\\varepsilon_u"
                    },
                    {
                        "type": "text",
                        "content": " are the concrete stress and the axial strain at the ultimate state, respectively, as defined previously; and  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "\\varepsilon_{u,\\text{bare}}"
                    },
                    {
                        "type": "text",
                        "content": " is the axial strain at the ultimate state of a corresponding bare CFT specimen. It is evident from Table 3 that both the stress and the axial strain at the ultimate state can be significantly enhanced as a result of FRP confinement. "
                    }
                ]
            },
            "bbox": [
                511,
                708,
                933,
                936
            ]
        },
        {
            "type": "page_aside_text",
            "content": {
                "page_aside_text_content": [
                    {
                        "type": "text",
                        "content": "Downloaded from asccelibrary.org by Beijing University of Tech on 01/22/26. Copyright ASCE. For personal use only; all rights reserved. "
                    }
                ]
            },
            "bbox": [
                0,
                217,
                17,
                779
            ]
        },
        {
            "type": "page_footer",
            "content": {
                "page_footer_content": [
                    {
                        "type": "text",
                        "content": "856 / JOURNAL OF COMPOSITES FOR CONSTRUCTION © ASCE / SEPTEMBER/OCTOBER 2011 "
                    }
                ]
            },
            "bbox": [
                63,
                949,
                665,
                963
            ]
        }
    ],
    [
        {
            "type": "table",
            "content": {
                "image_source": {
                    "path": "images/94b6067d6a2d7654119499938434821185e1a7c084b5748873df5ccd4fcea89e.jpg"
                },
                "table_caption": [
                    {
                        "type": "text",
                        "content": "Table 3. Summary of Key Test Results for Confined Concrete "
                    }
                ],
                "table_footnote": [
                    {
                        "type": "text",
                        "content": "<sup>a</sup>Value at the failure of an axial strain gauge; the real value is expected to be slightly higher than the value shown here. "
                    }
                ],
                "html": "<table><tr><td>Series</td><td>Specimen</td><td>f′cc(MPa)</td><td>f′cu(MPa)</td><td>f′cu/f′cc,bare</td><td>εu</td><td>εu/εu,bare</td></tr><tr><td rowspan=\"4\">102</td><td>F0-102</td><td>51.6</td><td>45.1</td><td>0.87</td><td>0.0093</td><td>1</td></tr><tr><td>F1-102</td><td></td><td></td><td>N/A</td><td></td><td></td></tr><tr><td>F2-102</td><td>68.3</td><td>68.3</td><td>1.32a</td><td>0.021</td><td>2.27</td></tr><tr><td>F3-102</td><td>77.0</td><td>73.5</td><td>1.42a</td><td>0.0236</td><td>2.53</td></tr><tr><td rowspan=\"4\">135</td><td>F0-135</td><td>50.5</td><td>43.4</td><td>0.86</td><td>0.009</td><td>1</td></tr><tr><td>F2-135</td><td>64.1</td><td>62.1</td><td>1.23</td><td>0.0155</td><td>1.72</td></tr><tr><td>F3-135</td><td>67.1</td><td>67.1</td><td>1.33</td><td>0.0171</td><td>1.90</td></tr><tr><td>F4-135</td><td>77.2</td><td>77.2</td><td>1.53a</td><td>0.0188</td><td>2.09</td></tr><tr><td rowspan=\"4\">202</td><td>F0-202</td><td>41.9</td><td>35.1</td><td>0.84</td><td>0.0102</td><td>1</td></tr><tr><td>F2-202</td><td>52.9</td><td>52.2</td><td>1.25</td><td>0.0168</td><td>1.65</td></tr><tr><td>F3-202</td><td>61.0</td><td>61.0</td><td>1.46</td><td>0.0194</td><td>1.90</td></tr><tr><td>F4-202</td><td>68.5</td><td>68.5</td><td>1.63</td><td>0.0217</td><td>2.12</td></tr></table>",
                "table_type": "complex_table",
                "table_nest_level": 1
            },
            "bbox": [
                63,
                56,
                483,
                265
            ]
        },
        {
            "type": "paragraph",
            "content": {
                "paragraph_content": [
                    {
                        "type": "text",
                        "content": "The axial stress-strain curves of the confined concrete are shown in Fig. 10 for all specimens except F1-102. For all bare CFT specimens, the curve features a descending branch following the attainment of the peak stress at a relatively small axial strain. By contrast, all curves for the FRP-confined CFT specimens have a continuously ascending shape, which consists of two approximately linear portions (i.e., the first and third portions) connected by a smooth curved portion (i.e., the second portion). As expected, the slope of the third portion is higher for specimens with a thicker FRP wrap which provides a larger amount of confining pressure. "
                    }
                ]
            },
            "bbox": [
                62,
                314,
                480,
                453
            ]
        },
        {
            "type": "paragraph",
            "content": {
                "paragraph_content": [
                    {
                        "type": "text",
                        "content": "To clarify the effect of the steel tube thickness on the confinement effectiveness, the normalized stress-strain curves of the three specimens with a two-ply FRP wrap (i.e., specimens F2-102, F2-135, and F2-202) are compared in Fig. 11, in which the stresses are normalized with respect to the unconfined concrete strength, and the strains are normalized with respect to the strain at the peak stress of unconfined concrete to facilitate comparisons. Fig. 11 reveals that the curves of the three specimens all have a similar first portion, indicating that the steel tube confinement does not affect the first portion significantly, and that those of specimens with a thicker steel tube generally have a higher second portion and third portion, reflecting the greater confinement provided by the steel tube. Despite this difference, the third portion of the three curves all have a similar slope. This is believed to be a result of the fact that beyond a certain axial strain level, the confining pressure from the steel tube became nearly constant or only increased slightly (see Fig. 9) and the increase in axial stress of the confined concrete basically came from the increasing confining pressure provided by the FRP wrap, which determines the slope of the final linear portion. The same observation can be made about the other sets of specimens with the same FRP wrap thickness (Hu 2011). "
                    }
                ]
            },
            "bbox": [
                62,
                454,
                482,
                746
            ]
        },
        {
            "type": "title",
            "content": {
                "title_content": [
                    {
                        "type": "text",
                        "content": "Confining Mechanism "
                    }
                ],
                "level": 1
            },
            "bbox": [
                63,
                757,
                230,
                772
            ]
        },
        {
            "type": "paragraph",
            "content": {
                "paragraph_content": [
                    {
                        "type": "text",
                        "content": "The confining pressure provided by the FRP wrap and the steel tube can be calculated by using the following two equations: "
                    }
                ]
            },
            "bbox": [
                63,
                777,
                482,
                806
            ]
        },
        {
            "type": "equation_interline",
            "content": {
                "math_content": "\\sigma_ {r, f r p} = \\frac {E _ {\\mathrm {f p}} t _ {\\mathrm {f p}} \\varepsilon_ {\\mathrm {f p}}}{(R + t _ {s})} \\tag {9}",
                "math_type": "latex",
                "image_source": {
                    "path": "images/8b0c1d4bca3b437e4e346377c3ee367064c67e283c1d50dcd700295bdaceaa7b.jpg"
                }
            },
            "bbox": [
                212,
                828,
                480,
                861
            ]
        },
        {
            "type": "equation_interline",
            "content": {
                "math_content": "\\sigma_ {r, \\text {s t e e l}} = \\frac {\\sigma_ {\\theta , \\text {s t e e l}} t _ {s}}{R} \\tag {10}",
                "math_type": "latex",
                "image_source": {
                    "path": "images/263c6be5607b00e49fd025c1451425b2abf6dcac66556c76c4bc7b0047e0fe2b.jpg"
                }
            },
            "bbox": [
                217,
                872,
                480,
                898
            ]
        },
        {
            "type": "paragraph",
            "content": {
                "paragraph_content": [
                    {
                        "type": "text",
                        "content": "in which  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "\\sigma_{r,\\mathrm{fpr}} ="
                    },
                    {
                        "type": "text",
                        "content": " confining pressure provided by the FRP wrap;  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "E_{\\mathrm{frp}}"
                    },
                    {
                        "type": "text",
                        "content": " and  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "t_\\mathrm{frp} ="
                    },
                    {
                        "type": "text",
                        "content": " elastic modulus in the hoop direction and thickness of the "
                    }
                ]
            },
            "bbox": [
                63,
                907,
                480,
                938
            ]
        },
        {
            "type": "image",
            "content": {
                "image_source": {
                    "path": "images/b5971d17c7aef814cec60cf047b4df75ab95633ce9912c297d0b0138d9bb31e3.jpg"
                },
                "image_caption": [],
                "image_footnote": []
            },
            "bbox": [
                570,
                36,
                879,
                234
            ]
        },
        {
            "type": "image",
            "content": {
                "image_source": {
                    "path": "images/7f053f41e81d5a3fe303332b80a2bd3dfaee9ebce797844745275ae57a775bd7.jpg"
                },
                "image_caption": [],
                "image_footnote": []
            },
            "bbox": [
                566,
                244,
                877,
                443
            ]
        },
        {
            "type": "image",
            "content": {
                "image_source": {
                    "path": "images/3c2ad45de9e2fd38f3fdd44be28ded5ea2ef46a63127edc5040208ed063501d9.jpg"
                },
                "image_caption": [
                    {
                        "type": "text",
                        "content": "Fig. 10. Axial stress-strain curves of concrete; (a) series 102, (b) series 135, (c) series 202 "
                    }
                ],
                "image_footnote": []
            },
            "bbox": [
                566,
                452,
                867,
                648
            ]
        },
        {
            "type": "paragraph",
            "content": {
                "paragraph_content": [
                    {
                        "type": "text",
                        "content": "FRP wrap, respectively;  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "\\varepsilon_{\\mathrm{frp}} ="
                    },
                    {
                        "type": "text",
                        "content": " hoop strain of the FRP wrap and is taken here as the average of the readings from the five hoop strain gauges outside the overlapping zone;  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "R ="
                    },
                    {
                        "type": "text",
                        "content": " radius of the concrete core;  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "\\sigma_{r,\\mathrm{steel}} ="
                    },
                    {
                        "type": "text",
                        "content": " confining pressure provided by the steel tube; and  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "\\sigma_{\\theta ,\\mathrm{steel}}"
                    },
                    {
                        "type": "text",
                        "content": " and  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "t_s ="
                    },
                    {
                        "type": "text",
                        "content": " hoop stress and thickness of the steel tube, respectively, in which the former can be obtained from Eqs. (1) and (2). "
                    }
                ]
            },
            "bbox": [
                511,
                712,
                931,
                797
            ]
        },
        {
            "type": "paragraph",
            "content": {
                "paragraph_content": [
                    {
                        "type": "text",
                        "content": "The total confining pressure received by the concrete, being the sum of the confining pressures from the FRP wrap and the steel tube as found by using Eqs. (9) and (10), are shown against the nominal axial strain in Fig. 12 for the specimens of series 135 to examine the confining mechanism for the concrete in an FRP-confined CFT. In particular, the contribution of the steel tube and that of the FRP wrap are compared in Fig. 13 for specimen F3-135 for further clarification. Figs. 12 and 13 reveal that the development of confining pressures can be generally divided into three stages. By referring to Fig. 10, we notice that the three stages of confining "
                    }
                ]
            },
            "bbox": [
                511,
                797,
                931,
                936
            ]
        },
        {
            "type": "page_aside_text",
            "content": {
                "page_aside_text_content": [
                    {
                        "type": "text",
                        "content": "Downloaded from asccelibrary.org by Beijing University of Tech on 01/22/26. Copyright ASCE. For personal use only; all rights reserved. "
                    }
                ]
            },
            "bbox": [
                0,
                217,
                17,
                779
            ]
        },
        {
            "type": "page_footer",
            "content": {
                "page_footer_content": [
                    {
                        "type": "text",
                        "content": "JOURNAL OF COMPOSITES FOR CONSTRUCTION © ASCE / SEPTEMBER/OCTOBER 2011 "
                    }
                ]
            },
            "bbox": [
                330,
                949,
                898,
                962
            ]
        },
        {
            "type": "page_number",
            "content": {
                "page_number_content": [
                    {
                        "type": "text",
                        "content": "857 "
                    }
                ]
            },
            "bbox": [
                906,
                950,
                931,
                960
            ]
        },
        {
            "type": "page_footer",
            "content": {
                "page_footer_content": [
                    {
                        "type": "text",
                        "content": "J. Compos. Constr., 2011, 15(5): 850-860 "
                    }
                ]
            },
            "bbox": [
                385,
                984,
                611,
                997
            ]
        }
    ],
    [
        {
            "type": "image",
            "content": {
                "image_source": {
                    "path": "images/1af3651ed71aea5680779e37e49b65badfc4c5cc01e25a2070377de6c41dc8ff.jpg"
                },
                "image_caption": [
                    {
                        "type": "text",
                        "content": "Fig. 11. Effect of steel tube thickness on axial stress-strain behavior of concrete "
                    }
                ],
                "image_footnote": []
            },
            "bbox": [
                127,
                37,
                421,
                224
            ]
        },
        {
            "type": "image",
            "content": {
                "image_source": {
                    "path": "images/5b6b9ea1f4916565c2270935844f8f2df148939ff9021b86212d321a08311090.jpg"
                },
                "image_caption": [
                    {
                        "type": "text",
                        "content": "Fig. 12. Total confining pressure to concrete core "
                    }
                ],
                "image_footnote": []
            },
            "bbox": [
                120,
                292,
                426,
                477
            ]
        },
        {
            "type": "image",
            "content": {
                "image_source": {
                    "path": "images/fbec8ce4a587569ff4a2f7acc3d99d1fd897d5ec799f04e278ca341a3c2ca591.jpg"
                },
                "image_caption": [
                    {
                        "type": "text",
                        "content": "Fig. 13. Confining pressure from FRP jacket and steel tube in specimen F3-135 "
                    }
                ],
                "image_footnote": []
            },
            "bbox": [
                104,
                532,
                439,
                720
            ]
        },
        {
            "type": "paragraph",
            "content": {
                "paragraph_content": [
                    {
                        "type": "text",
                        "content": "pressure development correspond to the three portions of the axial stress-strain curve. In the first stage (with the axial strain being smaller than around 0.002), the confining pressure from the steel tube is negative or nearly zero, whereas that from the FRP wrap develops slowly; the total confining pressure is therefore very small or even negative (i.e., radial tensile stresses exist at the steel-to-concrete interface unless the bond between the two breaks down). In this stage, the steel tube expands faster than the concrete because of its larger initial Poisson's ratio (i.e., around 0.3 compared to around 0.18), but its expansion is constrained by the FRP wrap, the Poisson's ratio of which is nearly zero, as it only has "
                    }
                ]
            },
            "bbox": [
                62,
                780,
                482,
                936
            ]
        },
        {
            "type": "paragraph",
            "content": {
                "paragraph_content": [
                    {
                        "type": "text",
                        "content": "fibers in the hoop direction. In the second stage (from the end of the first stage to an axial strain of around 0.006), both the confining pressures from the steel tube and the FRP wrap increase, but at different rates, which depend primarily on their hoop stiffnesses; the total confining pressure increases rapidly in this stage. In the third stage, the confining pressure from the steel tube is almost constant (for specimens without local buckling) or increases slowly (for specimens with local buckling), whereas that from the FRP wrap keeps increasing at a rate similar to that of the second stage, leading to a lower rate of overall confining pressure increase than that of the second stage. In the latter two stages, the concrete dilates significantly and faster than the steel tube, and it pushes the steel tube outward, resulting in a confining pressure at the interfaces and hoop tensile stresses in both the steel tube and the FRP wrap. Provided that local buckling of the steel tube does not occur, the hoop tensile stress in and the confining pressure provided by the steel tube eventually become nearly constant when the dilation rate of the concrete becomes similar to that of the steel tube in plastic flow; however, the confining pressure provided by the FRP wrap to the concrete through the steel tube continues to increase with lateral dilation as a result of its linear elastic behavior. If local buckling of the steel tube occurs near one of the ends, the midheight axial strain of the steel tube becomes nearly constant, whereas the hoop tensile stress in and the confining pressure provided by the steel tube keeps increasing as the dilation of the concrete increases. As a result, the end local buckling of the steel tube has a positive effect on the behavior of the concrete, as it allows a larger confining pressure from the steel tube to be developed. A similar observation was made by O'Shea and Bridge (1999) about bare concrete-filled steel tubes. "
                    }
                ]
            },
            "bbox": [
                511,
                42,
                933,
                459
            ]
        },
        {
            "type": "title",
            "content": {
                "title_content": [
                    {
                        "type": "text",
                        "content": "Lateral Expansion Behavior "
                    }
                ],
                "level": 1
            },
            "bbox": [
                514,
                470,
                725,
                486
            ]
        },
        {
            "type": "paragraph",
            "content": {
                "paragraph_content": [
                    {
                        "type": "text",
                        "content": "The lateral-to-axial strain curves are shown in Fig. 14 for the specimens of series 202, in which the nominal axial strain is once again used, whereas the lateral strain is the average of readings of the five hoop strain gauges outside the overlapping zone. Fig. 14 shows that the curves are generally higher for specimens with a thicker FRP wrap, indicating that at the same axial strain, the lateral expansion of the concrete is smaller when a thicker FRP wrap is used, as is expected. Similar lateral expansion behavior was also found in the other two series (Hu 2011). "
                    }
                ]
            },
            "bbox": [
                511,
                492,
                933,
                618
            ]
        },
        {
            "type": "title",
            "content": {
                "title_content": [
                    {
                        "type": "text",
                        "content": "Efficiency of the FRP Wrap "
                    }
                ],
                "level": 1
            },
            "bbox": [
                514,
                643,
                732,
                660
            ]
        },
        {
            "type": "paragraph",
            "content": {
                "paragraph_content": [
                    {
                        "type": "text",
                        "content": "Fig. 15 shows the distributions of the midheight hoop strain around the circumference at the ultimate state for the specimens of series "
                    }
                ]
            },
            "bbox": [
                513,
                670,
                933,
                700
            ]
        },
        {
            "type": "image",
            "content": {
                "image_source": {
                    "path": "images/3f389b1852ba780e576197ae52e76a2760c5932be5dac4bfb35cc206b6c73548.jpg"
                },
                "image_caption": [
                    {
                        "type": "text",
                        "content": "Fig. 14. Nominal axial strain versus hoop strain "
                    }
                ],
                "image_footnote": []
            },
            "bbox": [
                568,
                719,
                880,
                904
            ]
        },
        {
            "type": "page_aside_text",
            "content": {
                "page_aside_text_content": [
                    {
                        "type": "text",
                        "content": "Downloaded from asccelibrary.org by Beijing University of Tech on 01/22/26. Copyright ASCE. For personal use only; all rights reserved. "
                    }
                ]
            },
            "bbox": [
                0,
                217,
                17,
                779
            ]
        },
        {
            "type": "page_footer",
            "content": {
                "page_footer_content": [
                    {
                        "type": "text",
                        "content": "858 / JOURNAL OF COMPOSITES FOR CONSTRUCTION © ASCE / SEPTEMBER/OCTOBER 2011 "
                    }
                ]
            },
            "bbox": [
                63,
                949,
                665,
                963
            ]
        },
        {
            "type": "page_footer",
            "content": {
                "page_footer_content": [
                    {
                        "type": "text",
                        "content": "J. Compos. Constr., 2011, 15(5): 850-860 "
                    }
                ]
            },
            "bbox": [
                385,
                984,
                611,
                997
            ]
        }
    ],
    [
        {
            "type": "image",
            "content": {
                "image_source": {
                    "path": "images/4faa18dd2fdfa502f73440dfc9153fa81f3a8ee35ad7cf6d558c8bb77c38fe58.jpg"
                },
                "image_caption": [
                    {
                        "type": "text",
                        "content": "Fig. 15. Distributions of hoop strain at ultimate state "
                    }
                ],
                "image_footnote": []
            },
            "bbox": [
                112,
                36,
                434,
                219
            ]
        },
        {
            "type": "paragraph",
            "content": {
                "paragraph_content": [
                    {
                        "type": "text",
                        "content": "102. These strains were recorded by the six hoop strain gauges at the midheight of the FRP wrap (Fig. 2). It is obvious that the distribution is nonuniform around the circumference. For those specimens with a relatively thin FRP wrap (e.g., F1-102), the strain in the overlapping zone is seen to be smaller than those outside the overlapping zone, but such differences cannot be seen for the other specimens. These observations are different from the findings for FRP-confined concrete columns (Lam and Teng 2004), in which the strain within the overlapping zone is always smaller. This might be attributed to two reasons: (a) as a result of the existence of the steel tube, the action of the steel tube on the FRP wrap is closer to that of uniform radial expansion than a uniform radial pressure, which is closer to the situation of FRP-confined concrete columns; and (b) the weld seam of the steel tube located within the overlapping zone may have complicated the local stress/strain state in that region for the present specimens. "
                    }
                ]
            },
            "bbox": [
                62,
                277,
                480,
                500
            ]
        },
        {
            "type": "paragraph",
            "content": {
                "paragraph_content": [
                    {
                        "type": "text",
                        "content": "The efficiency of the FRP wrap is often evaluated by the so-called FRP efficiency factor  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "k_{\\varepsilon}"
                    },
                    {
                        "type": "text",
                        "content": ", which is defined to be the ratio of the average FRP hoop rupture strain in a confined column to the ultimate tensile strain obtained from flat coupon tests (Lam and Teng 2003, 2004; Pessiki et al. 2001). The FRP efficiency factor  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "k_{\\varepsilon}"
                    },
                    {
                        "type": "text",
                        "content": " can be interpreted as the product of two components (Pessiki et al. 2001): "
                    }
                ]
            },
            "bbox": [
                62,
                500,
                480,
                597
            ]
        },
        {
            "type": "equation_interline",
            "content": {
                "math_content": "k _ {\\varepsilon} = k _ {\\varepsilon 1} k _ {\\varepsilon 2} \\tag {11}",
                "math_type": "latex",
                "image_source": {
                    "path": "images/9471b6fbad9e849c707d81e1a68acc0887d971f6e61d033cb2e69813071cb889.jpg"
                }
            },
            "bbox": [
                233,
                613,
                480,
                628
            ]
        },
        {
            "type": "paragraph",
            "content": {
                "paragraph_content": [
                    {
                        "type": "text",
                        "content": "in which  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "k_{\\varepsilon 1} ="
                    },
                    {
                        "type": "text",
                        "content": " ratio of the average hoop strain to the maximum hoop strain at the ultimate state to account for the effect of nonuniform strain distribution in the FRP wrap and  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "k_{\\varepsilon 2} ="
                    },
                    {
                        "type": "text",
                        "content": " ratio of the maximum hoop strain in an FRP wrap at the ultimate state to the ultimate tensile strain from flat coupon tests. "
                    }
                ]
            },
            "bbox": [
                62,
                643,
                480,
                715
            ]
        },
        {
            "type": "paragraph",
            "content": {
                "paragraph_content": [
                    {
                        "type": "text",
                        "content": "The values of  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "k_{\\varepsilon 1}"
                    },
                    {
                        "type": "text",
                        "content": " and  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "\\tilde{k}_{\\varepsilon 2}"
                    },
                    {
                        "type": "text",
                        "content": " obtained from the present tests are shown in Figs. 16 and 17, respectively. In calculating  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "k_{\\varepsilon 1}"
                    },
                    {
                        "type": "text",
                        "content": ", only the readings from the strain gauges outside the overlapping zone were used. The value of  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "k_{\\varepsilon 1}"
                    },
                    {
                        "type": "text",
                        "content": " is seen to vary from 0.693 to 0.961, with a mean value of 0.865. The value of  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "k_{\\varepsilon 2}"
                    },
                    {
                        "type": "text",
                        "content": " is seen to vary from 0.824 to 1.133, with a mean value of 0.948. The average  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "k_{\\varepsilon 1}"
                    },
                    {
                        "type": "text",
                        "content": " value is similar to the average value of 0.908 for GFRP-confined concrete found by Lam and Teng (2004) from their tests, whereas the average  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "k_{\\varepsilon 2}"
                    },
                    {
                        "type": "text",
                        "content": " value is higher than the average value of 0.820 for GFRP-confined concrete found by Lam and Teng (2004) from their tests. The larger  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "k_{\\varepsilon 2}"
                    },
                    {
                        "type": "text",
                        "content": " values may be caused by the larger diameter of the specimens presented in this paper [i.e., around  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "200~\\mathrm{mm}"
                    },
                    {
                        "type": "text",
                        "content": " compared to around  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "150~\\mathrm{mm}"
                    },
                    {
                        "type": "text",
                        "content": " of the specimens examined in Lam and Teng (2004)], which means that the detrimental effect of curvature is less significant or caused by the less significant stress concentration because of the presence of a steel tube, which means that the maximum "
                    }
                ]
            },
            "bbox": [
                62,
                713,
                482,
                936
            ]
        },
        {
            "type": "image",
            "content": {
                "image_source": {
                    "path": "images/42a33048f7f17717bb414a5be08771ee685ac3f14f955f536d30491e6c3e3cce.jpg"
                },
                "image_caption": [
                    {
                        "type": "text",
                        "content": "Fig. 16. Strain nonuniformity factor "
                    }
                ],
                "image_footnote": []
            },
            "bbox": [
                553,
                37,
                895,
                220
            ]
        },
        {
            "type": "image",
            "content": {
                "image_source": {
                    "path": "images/551976480b37ad2a4847c15fe27cbc6c8b6fcbe0fbb510cfd66448654b60f164.jpg"
                },
                "image_caption": [
                    {
                        "type": "text",
                        "content": "Fig. 17. Ratio between in situ and material strain capacities "
                    }
                ],
                "image_footnote": []
            },
            "bbox": [
                553,
                277,
                895,
                462
            ]
        },
        {
            "type": "paragraph",
            "content": {
                "paragraph_content": [
                    {
                        "type": "text",
                        "content": "strain recorded by the discrete strain gauges is closer to the real maximum strain within the continuous FRP wrap. "
                    }
                ]
            },
            "bbox": [
                513,
                512,
                931,
                542
            ]
        },
        {
            "type": "title",
            "content": {
                "title_content": [
                    {
                        "type": "text",
                        "content": "Conclusions "
                    }
                ],
                "level": 1
            },
            "bbox": [
                514,
                566,
                617,
                580
            ]
        },
        {
            "type": "paragraph",
            "content": {
                "paragraph_content": [
                    {
                        "type": "text",
                        "content": "This paper presented an experimental study aimed at gaining a better understanding of the behavior of FRP-confined concrete-filled thin steel tubes under axial compression. The external FRP wrap is provided to constrain outward local buckling deformation of the steel tube and to provide additional confinement to the concrete. The experimental program included three series of tests, in which the main parameters examined were the thickness (or the diameter-to-thickness ratio) of the steel tube and the hoop stiffness of the FRP wrap. All steel tubes used in these tests had a diameter-to-thickness ratio exceeding 100, and the GFRP used had a nominal thickness ranging from  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "0.17\\mathrm{mm}"
                    },
                    {
                        "type": "text",
                        "content": " to  "
                    },
                    {
                        "type": "equation_inline",
                        "content": "0.68\\mathrm{mm}"
                    },
                    {
                        "type": "text",
                        "content": ". On the basis of the detailed instrumentation employed in the tests and in-depth examination on test results, the following conclusions can be drawn: "
                    }
                ]
            },
            "bbox": [
                511,
                595,
                931,
                782
            ]
        },
        {
            "type": "list",
            "content": {
                "list_type": "text_list",
                "list_items": [
                    {
                        "item_type": "text",
                        "item_content": [
                            {
                                "type": "text",
                                "content": "1. The FRP wrap is highly effective in improving the axial compressive behavior of concrete-filled thin steel tubes, in terms of both the load-carrying capacity and the ductility. All specimens failed by the explosive rupture of FRP in the midheight region because of the lateral expansion of concrete. "
                            }
                        ]
                    },
                    {
                        "item_type": "text",
                        "item_content": [
                            {
                                "type": "text",
                                "content": "2. The local buckling of a steel tube in a CFT column can be either much delayed or completely suppressed by the FRP wrap, and the strength and the strain capacity of the concrete can be significantly enhanced with the additional confinement from the FRP wrap. The effect of FRP wraps is more pronounced for CFT columns with a thinner steel tube. "
                            }
                        ]
                    }
                ]
            },
            "bbox": [
                521,
                782,
                931,
                936
            ]
        },
        {
            "type": "page_aside_text",
            "content": {
                "page_aside_text_content": [
                    {
                        "type": "text",
                        "content": "Downloaded from asccelibrary.org by Beijing University of Tech on 01/22/26. Copyright ASCE. For personal use only; all rights reserved. "
                    }
                ]
            },
            "bbox": [
                0,
                217,
                17,
                779
            ]
        },
        {
            "type": "page_footer",
            "content": {
                "page_footer_content": [
                    {
                        "type": "text",
                        "content": "JOURNAL OF COMPOSITES FOR CONSTRUCTION © ASCE / SEPTEMBER/OCTOBER 2011 "
                    }
                ]
            },
            "bbox": [
                330,
                949,
                898,
                962
            ]
        },
        {
            "type": "page_number",
            "content": {
                "page_number_content": [
                    {
                        "type": "text",
                        "content": "859 "
                    }
                ]
            },
            "bbox": [
                906,
                950,
                931,
                962
            ]
        },
        {
            "type": "page_footer",
            "content": {
                "page_footer_content": [
                    {
                        "type": "text",
                        "content": "J. Compos. Constr., 2011, 15(5): 850-860 "
                    }
                ]
            },
            "bbox": [
                385,
                984,
                611,
                997
            ]
        }
    ],
    [
        {
            "type": "list",
            "content": {
                "list_type": "reference_list",
                "list_items": [
                    {
                        "item_type": "text",
                        "item_content": [
                            {
                                "type": "text",
                                "content": "3. The axial stress-strain behavior of concrete in FRP-confined CFTs has three distinctive stages, including a first stage similar to that of unconfined concrete, a second stage in which the stress increases rapidly resulting from a rapidly increasing confining pressure provided by both the steel tube and the FRP wrap, and a third stage in which the confinement provided by the FRP wrap dominates its behavior. "
                            }
                        ]
                    }
                ]
            },
            "bbox": [
                71,
                42,
                480,
                140
            ]
        },
        {
            "type": "title",
            "content": {
                "title_content": [
                    {
                        "type": "text",
                        "content": "Acknowledgments "
                    }
                ],
                "level": 1
            },
            "bbox": [
                63,
                162,
                210,
                178
            ]
        },
        {
            "type": "paragraph",
            "content": {
                "paragraph_content": [
                    {
                        "type": "text",
                        "content": "The writers are grateful to the Research Grants Council of Hong Kong (PolyU 5269/05E) and The Hong Kong Polytechnic University (G-U274 and RGU4) for their financial support. "
                    }
                ]
            },
            "bbox": [
                63,
                188,
                480,
                231
            ]
        },
        {
            "type": "title",
            "content": {
                "title_content": [
                    {
                        "type": "text",
                        "content": "References "
                    }
                ],
                "level": 1
            },
            "bbox": [
                63,
                253,
                156,
                268
            ]
        },
        {
            "type": "list",
            "content": {
                "list_type": "reference_list",
                "list_items": [
                    {
                        "item_type": "text",
                        "item_content": [
                            {
                                "type": "text",
                                "content": "ASTM D3039. (2000). \"Standard test method for tensile properties of polymer matrix composite materials.\" ASTM, West Conshohocken, PA. "
                            }
                        ]
                    },
                    {
                        "item_type": "text",
                        "item_content": [
                            {
                                "type": "text",
                                "content": "BS 18. (1987). \"British standard method for tensile testing of metals.\" British Standard Institution, London. "
                            }
                        ]
                    },
                    {
                        "item_type": "text",
                        "item_content": [
                            {
                                "type": "text",
                                "content": "Calladine, C. R. (1985). Plasticity for engineers, Halsted Press, New York. "
                            }
                        ]
                    },
                    {
                        "item_type": "text",
                        "item_content": [
                            {
                                "type": "text",
                                "content": "Gu, W., Guan, C. W., Zhao, Y. H., and Cao, H. (2004). \"Experimental study on concentrically-compressed circular concrete filled CFRP-steel composite tubular short columns.\" Shenyang Jianzhu Gongcheng Xueyuan Xuebao, 20(2), 118-120. "
                            }
                        ]
                    },
                    {
                        "item_type": "text",
                        "item_content": [
                            {
                                "type": "text",
                                "content": "Hajjar, J. F. (2000). \"Concrete-filled steel tube columns under earthquake loads.\" Prog. Struct. Eng. Mater., 2, 72-81. "
                            }
                        ]
                    },
                    {
                        "item_type": "text",
                        "item_content": [
                            {
                                "type": "text",
                                "content": "Hu, Y. M. (2011). \"Behavior and modelling of FRP-confined hollow and concrete-filled steel tubular columns.\" Ph.D. thesis, Dept. of Civil and Structural Engineering, The Hong Kong Polytechnic Univ., Hong Kong. "
                            }
                        ]
                    },
                    {
                        "item_type": "text",
                        "item_content": [
                            {
                                "type": "text",
                                "content": "Johansson, M., and Gylltoft, K. (2002). \"Mechanical behavior of circular steel-concrete composite stub columns.\" J. Struct. Eng., 128(8), 1073-1081. "
                            }
                        ]
                    },
                    {
                        "item_type": "text",
                        "item_content": [
                            {
                                "type": "text",
                                "content": "Lam, L., and Teng, J. G. (2003). \"Design-oriented stress-strain model for FRP-confined concrete.\" Constr. Build. Mater., 17(6-7), 471-489. "
                            }
                        ]
                    }
                ]
            },
            "bbox": [
                66,
                279,
                480,
                545
            ]
        },
        {
            "type": "list",
            "content": {
                "list_type": "reference_list",
                "list_items": [
                    {
                        "item_type": "text",
                        "item_content": [
                            {
                                "type": "text",
                                "content": "Lam, L., and Teng, J. G. (2004). \"Ultimate condition of fiber reinforced polymer-confined concrete.\" J. Compos. Constr., 8(6), 539-548. "
                            }
                        ]
                    },
                    {
                        "item_type": "text",
                        "item_content": [
                            {
                                "type": "text",
                                "content": "Liu, L., and Lu, Y. Y. (2010). \"Axial bearing capacity of short frp confined concrete-filled steel tubular columns.\" J. Wuhan Univ. Technol., Mater. Sci. Ed., 25(3), 454-458. "
                            }
                        ]
                    },
                    {
                        "item_type": "text",
                        "item_content": [
                            {
                                "type": "text",
                                "content": "Mao, X. Y., and Xiao, Y. (2006). \"Seismic behavior of confined square CFT columns.\" Eng. Struct., 28(10), 1378-1386. "
                            }
                        ]
                    },
                    {
                        "item_type": "text",
                        "item_content": [
                            {
                                "type": "text",
                                "content": "O'Shea, M. D., and Bridge, R. Q. (1999). \"The effects of local buckling and confinement in concrete filled circular steel tubes.\" Proc., Mechanics of Structures and Materials, Sydney, NSW, Australia, 321-326. "
                            }
                        ]
                    },
                    {
                        "item_type": "text",
                        "item_content": [
                            {
                                "type": "text",
                                "content": "Park, J. W., Hong, Y. K., and Choi, S. M. (2010). \"Behaviors of concrete filled square steel tubes confined by carbon fiber sheets (CFS) under compression and cyclic loads.\" *Steel Compos. Struct.*, 10(2), 187-205. "
                            }
                        ]
                    },
                    {
                        "item_type": "text",
                        "item_content": [
                            {
                                "type": "text",
                                "content": "Pessiki, S., Harries, K. A., Kestner, J. T., Sause, R., and Ricles, J. M. (2001). \"Axial behavior of reinforced concrete columns confined with FRP jackets.\" J. Compos. Constr., 5(4), 237-245. "
                            }
                        ]
                    },
                    {
                        "item_type": "text",
                        "item_content": [
                            {
                                "type": "text",
                                "content": "Shan, J. H., Chen, R., Zhang, W. X., Xiao, Y., Yi, W. J., and Lu, F. Y. (2007). \"Behavior of concrete filled tubes and confined concrete filled tubes under high speed impact.\" Adv. Struct. Eng., 10(2), 209-218. "
                            }
                        ]
                    },
                    {
                        "item_type": "text",
                        "item_content": [
                            {
                                "type": "text",
                                "content": "Tao, Z., Han, L. H., and Zhuang, J. P. (2007). \"Axial loading behavior of CFRP strengthened concrete-filled steel tubular stub columns.\" Adv. Struct. Eng., 10(1), 37-46. "
                            }
                        ]
                    },
                    {
                        "item_type": "text",
                        "item_content": [
                            {
                                "type": "text",
                                "content": "Teng, J. G., Chen, J. F., Smith, S. T., and Lam, L. (2002). FRP-strengthened RC structures, Wiley, Chichester, UK "
                            }
                        ]
                    },
                    {
                        "item_type": "text",
                        "item_content": [
                            {
                                "type": "text",
                                "content": "Teng, J. G., and Hu, Y. M. (2006). \"Theoretical model for FRP-confined circular concrete-filled steel tubes under axial compression.\" Proc., 3rd Int. Conf. on FRP Composites in Civil Engineering, Miami, 503-506. "
                            }
                        ]
                    },
                    {
                        "item_type": "text",
                        "item_content": [
                            {
                                "type": "text",
                                "content": "Uy, B. (1998). \"Concrete-filled fabricated steel box columns for multi-storey buildings.\" Prog. Struct. Eng. Mater., 1(2), 150-158. "
                            }
                        ]
                    },
                    {
                        "item_type": "text",
                        "item_content": [
                            {
                                "type": "text",
                                "content": "Wang, Z. B., Tao, Z., and Han, L. H. (2008). \"Performance of CFRP-strengthened concrete filled steel tubes under axial compression.\" Proc., 10th Int. Symp. on Structural Engineering for Young Experts, Hunan Univ., Changsha, China, 689-694. "
                            }
                        ]
                    },
                    {
                        "item_type": "text",
                        "item_content": [
                            {
                                "type": "text",
                                "content": "Xiao, Y. (2004). \"Applications of FRP composites in concrete columns.\" Adv. Struct. Eng., 7(4), 335-343. "
                            }
                        ]
                    },
                    {
                        "item_type": "text",
                        "item_content": [
                            {
                                "type": "text",
                                "content": "Xiao, Y., He, W. H., and Choi, K. K. (2005). \"Confined concrete-filled tubular columns.\" J. Struct. Eng., 131(3), 488-497. "
                            }
                        ]
                    }
                ]
            },
            "bbox": [
                516,
                42,
                934,
                545
            ]
        },
        {
            "type": "page_aside_text",
            "content": {
                "page_aside_text_content": [
                    {
                        "type": "text",
                        "content": "Downloaded from ascelibrary.org by Beijing University of Tech on 01/22/26. Copyright ASCE. For personal use only; all rights reserved. "
                    }
                ]
            },
            "bbox": [
                0,
                215,
                17,
                779
            ]
        },
        {
            "type": "page_number",
            "content": {
                "page_number_content": [
                    {
                        "type": "text",
                        "content": "860 "
                    }
                ]
            },
            "bbox": [
                66,
                950,
                91,
                962
            ]
        },
        {
            "type": "page_footer",
            "content": {
                "page_footer_content": [
                    {
                        "type": "text",
                        "content": "JOURNAL OF COMPOSITES FOR CONSTRUCTION © ASCE / SEPTEMBER/OCTOBER 2011 "
                    }
                ]
            },
            "bbox": [
                96,
                949,
                665,
                962
            ]
        },
        {
            "type": "page_footer",
            "content": {
                "page_footer_content": [
                    {
                        "type": "text",
                        "content": "J. Compos. Constr., 2011, 15(5): 850-860 "
                    }
                ]
            },
            "bbox": [
                387,
                984,
                609,
                997
            ]
        }
    ]
]